; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v3;\\n\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22kvexecutor\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22base64\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22encoding/base64\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22encoding/base64\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22json\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22encoding/json\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22encoding/json\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22shim\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/hyperledger/fabric-chaincode-go/shim\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"Dwarf Version", i32 4}
!3 = distinct !DICompileUnit(language: DW_LANG_Go, file: !4, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !5)
!4 = !DIFile(filename: "./83.go", directory: "/home/ming/go/src/chaincode_repo/github/83")
!5 = !{!6, !23}
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !3, file: !8, line: 1, type: !9, isLocal: false, isDefinition: true)
!8 = !DIFile(filename: "<built-in>", directory: "")
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{bool,[3]uint8,bool,bool,uint64}", file: !10, size: 128, align: 8, elements: !11)
!10 = !DIFile(filename: "", directory: "")
!11 = !{!12, !14, !19, !20, !21}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", file: !10, line: 1, baseType: !13, size: 8, align: 8)
!13 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "pad", file: !10, line: 1, baseType: !15, size: 24, align: 8, offset: 8)
!15 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 24, align: 1, elements: !17)
!16 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!17 = !{!18}
!18 = !DISubrange(count: 3, lowerBound: 0)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "needed", file: !10, line: 1, baseType: !13, size: 8, align: 8, offset: 32)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "cgo", file: !10, line: 1, baseType: !13, size: 8, align: 8, offset: 40)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "alignme", file: !10, line: 1, baseType: !22, size: 64, align: 64, offset: 64)
!22 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(name: "encoding_1base64.StdEncoding", linkageName: "encoding_1base64.StdEncoding", scope: !3, file: !25, line: 10, type: !26, isLocal: false, isDefinition: true)
!25 = !DIFile(filename: "83.go", directory: ".")
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "Encoding", file: !25, line: 10, size: 2624, align: 4, elements: !28)
!28 = !{!29, !33, !37, !39}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "encode", file: !25, line: 10, baseType: !30, size: 512, align: 8)
!30 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 512, align: 1, elements: !31)
!31 = !{!32}
!32 = !DISubrange(count: 64, lowerBound: 0)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "decodeMap", file: !25, line: 10, baseType: !34, size: 2048, align: 8, offset: 512)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 2048, align: 1, elements: !35)
!35 = !{!36}
!36 = !DISubrange(count: 256, lowerBound: 0)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "padChar", file: !25, line: 10, baseType: !38, size: 32, align: 32, offset: 2560)
!38 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "strict", file: !25, line: 10, baseType: !13, size: 8, align: 8, offset: 2592)
!40 = distinct !DISubprogram(name: "command-line-arguments.KVExecutor.Init", linkageName: "command_x2dline_x2darguments.KVExecutor.Init", scope: null, file: !25, line: 36, type: !41, scopeLine: 36, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !61)
!41 = !DISubroutineType(types: !42)
!42 = !{!43, !64, !64, !66}
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "Response", file: !25, line: 14, size: 640, align: 8, elements: !44)
!44 = !{!45, !46, !53, !59, !62, !63}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "Status", file: !25, line: 14, baseType: !38, size: 32, align: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "Message", file: !25, line: 14, baseType: !47, size: 128, align: 64, offset: 64)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !8, line: 1, size: 128, align: 8, elements: !48)
!48 = !{!49, !51}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !8, line: 1, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !8, line: 1, baseType: !52, size: 64, align: 64, offset: 64)
!52 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "Payload", file: !25, line: 14, baseType: !54, size: 192, align: 64, offset: 192)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !10, size: 192, align: 8, elements: !55)
!55 = !{!56, !57, !58}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !50, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !10, line: 1, baseType: !52, size: 64, align: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !10, line: 1, baseType: !52, size: 64, align: 64, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_NoUnkeyedLiteral", file: !25, line: 14, baseType: !60, align: 8, offset: 384)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !8, line: 1, align: 1, elements: !61)
!61 = !{}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !25, line: 14, baseType: !54, size: 192, align: 64, offset: 384)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_sizecache", file: !25, line: 14, baseType: !38, size: 32, align: 32, offset: 576)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "KVExecutor", file: !25, line: 22, align: 1, elements: !61)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "ChaincodeStubInterface", file: !25, line: 14, size: 128, align: 8, elements: !67)
!67 = !{!68, !416}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 14, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string,struct{*string,int,int})struct{string,error},*func(*void,string,string)error,*func(*void,string)error,*func(*void)struct{*struct{*uint8,int,int},int,int},*func(*void)struct{struct{*uint8,int,int},error},*func(*void)struct{struct{*uint8,int,int},error},*func(*void)string,*func(*void)struct{struct{*uint8,int,int},error},*func(*void)Values,*func(*void)struct{string,struct{*string,int,int}},*func(*void,string)struct{HistoryQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string,string,struct{*string,int,int})struct{StateQueryIteratorInterface,error},*func(*void,string,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string)struct{StateQueryIteratorInterface,error},*func(*void,string,int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void)struct{*SignedProposal,error},*func(*void,string)struct{struct{*uint8,int,int},error},*func(*void,string,struct{*string,int,int})struct{StateQueryIteratorInterface,error},*func(*void,string,struct{*string,int,int},int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string,int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void,string)struct{struct{*uint8,int,int},error},*func(*void)struct{*string,int,int},*func(*void)struct{Values,error},*func(*void)string,*func(*void)struct{*Timestamp,error},*func(*void,string,struct{*struct{*uint8,int,int},int,int},string)Response,*func(*void,string,string)error,*func(*void,string,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string)struct{string,struct{*string,int,int},error}}", file: !10, size: 2496, align: 8, elements: !71)
!71 = !{!72, !115, !138, !142, !146, !154, !162, !163, !164, !165, !182, !189, !1433, !1437, !1464, !1468, !1469, !1473, !1474, !1478, !1493, !1505, !1509, !1513, !1517, !1518, !1522, !1523, !1527, !1534, !1535, !1542, !1546, !1547, !1551, !1555, !1556, !1557, !1558}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !10, line: 14, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !8, line: 1, size: 512, align: 8, elements: !75)
!75 = !{!76, !78, !79, !81, !82, !83, !84, !85, !95, !96, !98, !114}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !8, line: 1, baseType: !77, size: 64, align: 64)
!77 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !8, line: 1, baseType: !77, size: 64, align: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !8, line: 1, baseType: !80, size: 32, align: 32, offset: 128)
!80 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 160)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 168)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 176)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 184)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !8, line: 1, baseType: !86, size: 64, align: 64, offset: 192)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !8, line: 1, size: 64, align: 8, elements: !88)
!88 = !{!89}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !8, line: 1, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DISubroutineType(types: !92)
!92 = !{!13, !93, !93}
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIBasicType(name: "void")
!95 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !8, line: 1, baseType: !50, size: 64, align: 64, offset: 256)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !8, line: 1, baseType: !97, size: 64, align: 64, offset: 320)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !8, line: 1, baseType: !99, size: 64, align: 64, offset: 384)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !8, line: 1, size: 320, align: 8, elements: !101)
!101 = !{!102, !103, !104}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !8, line: 1, baseType: !97, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !8, line: 1, baseType: !97, size: 64, align: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !8, line: 1, baseType: !105, size: 192, align: 64, offset: 128)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !10, size: 192, align: 8, elements: !106)
!106 = !{!107, !57, !58}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !8, line: 1, size: 320, align: 8, elements: !110)
!110 = !{!102, !103, !111, !112, !113}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !8, line: 1, baseType: !93, size: 64, align: 64, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !8, line: 1, baseType: !93, size: 64, align: 64, offset: 192)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !8, line: 1, baseType: !93, size: 64, align: 64, offset: 256)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !8, line: 1, baseType: !93, size: 64, align: 64, offset: 448)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "CreateCompositeKey", file: !10, line: 14, baseType: !116, size: 64, align: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!119, !93, !47, !135}
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,error}", file: !10, size: 256, align: 8, elements: !120)
!120 = !{!121, !122}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 14, baseType: !47, size: 128, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 14, baseType: !123, size: 128, align: 64, offset: 128)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !8, line: 1, size: 128, align: 8, elements: !124)
!124 = !{!125, !134}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 1, baseType: !126, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !10, size: 128, align: 8, elements: !128)
!128 = !{!129, !130}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !10, line: 1, baseType: !73, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !10, line: 1, baseType: !131, size: 64, align: 64, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!47, !93}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !8, line: 1, baseType: !93, size: 64, align: 64, offset: 64)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !10, size: 192, align: 8, elements: !136)
!136 = !{!137, !57, !58}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !97, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "DelPrivateData", file: !10, line: 14, baseType: !139, size: 64, align: 64, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{!123, !93, !47, !47}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "DelState", file: !10, line: 14, baseType: !143, size: 64, align: 64, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!123, !93, !47}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "GetArgs", file: !10, line: 14, baseType: !147, size: 64, align: 64, offset: 256)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!150, !93}
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*uint8,int,int},int,int}", file: !10, size: 192, align: 8, elements: !151)
!151 = !{!152, !57, !58}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "GetArgsSlice", file: !10, line: 14, baseType: !155, size: 64, align: 64, offset: 320)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{!158, !93}
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*uint8,int,int},error}", file: !10, size: 320, align: 8, elements: !159)
!159 = !{!160, !161}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 15, baseType: !54, size: 192, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 15, baseType: !123, size: 128, align: 64, offset: 192)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "GetBinding", file: !10, line: 14, baseType: !155, size: 64, align: 64, offset: 384)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "GetChannelID", file: !10, line: 14, baseType: !131, size: 64, align: 64, offset: 448)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "GetCreator", file: !10, line: 14, baseType: !155, size: 64, align: 64, offset: 512)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "GetDecorations", file: !10, line: 14, baseType: !166, size: 64, align: 64, offset: 576)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!169, !93}
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !8, line: 1, size: 384, align: 8, elements: !171)
!171 = !{!172, !173, !174, !175, !177, !178, !179, !180, !181}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !8, line: 1, baseType: !52, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 72)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !8, line: 1, baseType: !176, size: 16, align: 16, offset: 80)
!176 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !8, line: 1, baseType: !80, size: 32, align: 32, offset: 96)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !8, line: 1, baseType: !93, size: 64, align: 64, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !8, line: 1, baseType: !93, size: 64, align: 64, offset: 192)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !8, line: 1, baseType: !77, size: 64, align: 64, offset: 256)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !8, line: 1, baseType: !93, size: 64, align: 64, offset: 320)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "GetFunctionAndParameters", file: !10, line: 14, baseType: !183, size: 64, align: 64, offset: 640)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!186, !93}
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,struct{*string,int,int}}", file: !10, size: 320, align: 8, elements: !187)
!187 = !{!121, !188}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 14, baseType: !135, size: 192, align: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "GetHistoryForKey", file: !10, line: 14, baseType: !190, size: 64, align: 64, offset: 704)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!193, !93, !47}
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{HistoryQueryIteratorInterface,error}", file: !10, size: 256, align: 8, elements: !194)
!194 = !{!195, !122}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 14, baseType: !196, size: 128, align: 64)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "HistoryQueryIteratorInterface", file: !25, line: 14, size: 128, align: 8, elements: !197)
!197 = !{!198, !416}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 14, baseType: !199, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void)bool,*func(*void)struct{*KeyModification,error}}", file: !10, size: 256, align: 8, elements: !201)
!201 = !{!72, !202, !206, !210}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !10, line: 14, baseType: !203, size: 64, align: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!123, !93}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "HasNext", file: !10, line: 14, baseType: !207, size: 64, align: 64, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{!13, !93}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "Next", file: !10, line: 14, baseType: !211, size: 64, align: 64, offset: 192)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{!214, !93}
!214 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*KeyModification,error}", file: !10, size: 192, align: 8, elements: !215)
!215 = !{!216, !916}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 14, baseType: !217, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "KeyModification", file: !25, line: 14, size: 704, align: 8, elements: !219)
!219 = !{!220, !221, !222, !1429, !1430, !1431, !1432}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "TxId", file: !25, line: 14, baseType: !47, size: 128, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !25, line: 14, baseType: !54, size: 192, align: 64, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "Timestamp", file: !25, line: 14, baseType: !223, size: 64, align: 64, offset: 320)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "Timestamp", file: !25, line: 14, size: 448, align: 8, elements: !225)
!225 = !{!226, !1424, !1425, !1426, !1428}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !25, line: 14, baseType: !227, size: 64, align: 64)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageState", file: !25, line: 14, size: 64, align: 8, elements: !228)
!228 = !{!229, !231, !242, !248}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "NoUnkeyedLiterals", file: !25, line: 14, baseType: !230, align: 8)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "NoUnkeyedLiterals", file: !25, line: 14, align: 1, elements: !61)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "DoNotCompare", file: !25, line: 14, baseType: !232, align: 64)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, align: 8, elements: !240)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !25, line: 14, size: 64, align: 8, elements: !235)
!235 = !{!236}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !25, line: 14, baseType: !237, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{!94}
!240 = !{!241}
!241 = !DISubrange(count: 0, lowerBound: 0)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "DoNotCopy", file: !25, line: 14, baseType: !243, align: 32)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, align: 4, elements: !240)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !25, line: 14, size: 64, align: 4, elements: !245)
!245 = !{!246, !247}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !25, line: 14, baseType: !38, size: 32, align: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !25, line: 14, baseType: !80, size: 32, align: 32, offset: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "atomicMessageInfo", file: !25, line: 14, baseType: !249, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageInfo", file: !25, line: 14, size: 2624, align: 8, elements: !251)
!251 = !{!252, !417, !1216, !1224, !1229, !1230, !1231, !1326}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "GoReflectType", file: !25, line: 14, baseType: !253, size: 128, align: 64)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type", file: !25, line: 11, size: 128, align: 8, elements: !254)
!254 = !{!255, !416}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 11, baseType: !256, size: 64, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)int,*func(*void,Type)bool,*func(*void)int,*func(*void)ChanDir,*func(*void)bool,*func(*void,Type)bool,*func(*void)Type,*func(*void,int)StructField,*func(*void)int,*func(*void,struct{*int,int,int})StructField,*func(*void,string)struct{StructField,bool},*func(*void,*__go_descriptor)struct{StructField,bool},*func(*void,Type)bool,*func(*void,int)Type,*func(*void)bool,*func(*void)Type,*func(*void)Kind,*func(*void)int,*func(*void,int)Method,*func(*void,string)struct{Method,bool},*func(*void)string,*func(*void)int,*func(*void)int,*func(*void)int,*func(*void)int,*func(*void,int)Type,*func(*void)string,*func(*void)uintptr,*func(*void)string,*func(*void)*.reflect.rtype,*func(*void)string,*func(*void)*.reflect.uncommonType}", file: !10, size: 2112, align: 8, elements: !258)
!258 = !{!259, !260, !264, !268, !269, !274, !275, !276, !280, !301, !302, !306, !314, !325, !326, !330, !331, !332, !337, !338, !387, !395, !396, !397, !398, !399, !400, !401, !402, !406, !407, !411, !412}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !10, line: 11, baseType: !73, size: 64, align: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "Align", file: !10, line: 11, baseType: !261, size: 64, align: 64, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{!52, !93}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "AssignableTo", file: !10, line: 11, baseType: !265, size: 64, align: 64, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{!13, !93, !253}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "Bits", file: !10, line: 11, baseType: !261, size: 64, align: 64, offset: 192)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "ChanDir", file: !10, line: 11, baseType: !270, size: 64, align: 64, offset: 256)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!273, !93}
!273 = !DIBasicType(name: "ChanDir", size: 64, encoding: DW_ATE_signed)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "Comparable", file: !10, line: 11, baseType: !207, size: 64, align: 64, offset: 320)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "ConvertibleTo", file: !10, line: 11, baseType: !265, size: 64, align: 64, offset: 384)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "Elem", file: !10, line: 11, baseType: !277, size: 64, align: 64, offset: 448)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!253, !93}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "Field", file: !10, line: 11, baseType: !281, size: 64, align: 64, offset: 512)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DISubroutineType(types: !283)
!283 = !{!284, !93, !52}
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructField", file: !25, line: 11, size: 832, align: 8, elements: !285)
!285 = !{!286, !287, !288, !289, !294, !295, !300}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !25, line: 11, baseType: !47, size: 128, align: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "PkgPath", file: !25, line: 11, baseType: !47, size: 128, align: 64, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !25, line: 11, baseType: !253, size: 128, align: 64, offset: 256)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "Tag", file: !25, line: 11, baseType: !290, size: 128, align: 64, offset: 384)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructTag", file: !25, line: 11, size: 128, align: 8, elements: !291)
!291 = !{!292, !293}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !25, line: 1, baseType: !50, size: 64, align: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !25, line: 1, baseType: !52, size: 64, align: 64, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", file: !25, line: 11, baseType: !77, size: 64, align: 64, offset: 512)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !25, line: 11, baseType: !296, size: 192, align: 64, offset: 576)
!296 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*int,int,int}", file: !10, size: 192, align: 8, elements: !297)
!297 = !{!298, !57, !58}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !299, size: 64, align: 64)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "Anonymous", file: !25, line: 11, baseType: !13, size: 8, align: 8, offset: 768)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "FieldAlign", file: !10, line: 11, baseType: !261, size: 64, align: 64, offset: 576)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "FieldByIndex", file: !10, line: 11, baseType: !303, size: 64, align: 64, offset: 640)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DISubroutineType(types: !305)
!305 = !{!284, !93, !296}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "FieldByName", file: !10, line: 11, baseType: !307, size: 64, align: 64, offset: 704)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DISubroutineType(types: !309)
!309 = !{!310, !93, !47}
!310 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{StructField,bool}", file: !10, size: 896, align: 8, elements: !311)
!311 = !{!312, !313}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 11, baseType: !284, size: 832, align: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 11, baseType: !13, size: 8, align: 8, offset: 832)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "FieldByNameFunc", file: !10, line: 11, baseType: !315, size: 64, align: 64, offset: 768)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DISubroutineType(types: !317)
!317 = !{!310, !93, !318}
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !25, line: 11, size: 64, align: 8, elements: !320)
!320 = !{!321}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !25, line: 11, baseType: !322, size: 64, align: 64)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{!13, !47}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "Implements", file: !10, line: 11, baseType: !265, size: 64, align: 64, offset: 832)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "In", file: !10, line: 11, baseType: !327, size: 64, align: 64, offset: 896)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!253, !93, !52}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "IsVariadic", file: !10, line: 11, baseType: !207, size: 64, align: 64, offset: 960)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "Key", file: !10, line: 11, baseType: !277, size: 64, align: 64, offset: 1024)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "Kind", file: !10, line: 11, baseType: !333, size: 64, align: 64, offset: 1088)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DISubroutineType(types: !335)
!335 = !{!336, !93}
!336 = !DIBasicType(name: "Kind", size: 64, encoding: DW_ATE_unsigned)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !10, line: 11, baseType: !261, size: 64, align: 64, offset: 1152)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "Method", file: !10, line: 11, baseType: !339, size: 64, align: 64, offset: 1216)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!342, !93, !52}
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: "Method", file: !25, line: 11, size: 640, align: 8, elements: !343)
!343 = !{!286, !287, !288, !344, !386}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "Func", file: !25, line: 11, baseType: !345, size: 192, align: 64, offset: 384)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "Value", file: !25, line: 11, size: 192, align: 8, elements: !346)
!346 = !{!347, !383, !384}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !25, line: 11, baseType: !348, size: 64, align: 64)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: ".reflect.rtype", file: !25, line: 11, size: 512, align: 8, elements: !350)
!350 = !{!351, !352, !353, !354, !356, !357, !358, !359, !364, !365, !366, !382}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !25, line: 11, baseType: !77, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !25, line: 11, baseType: !77, size: 64, align: 64, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !25, line: 11, baseType: !80, size: 32, align: 32, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !25, line: 11, baseType: !355, size: 8, align: 8, offset: 160)
!355 = !DIBasicType(name: ".reflect.tflag", size: 8, encoding: DW_ATE_unsigned)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !25, line: 11, baseType: !16, size: 8, align: 8, offset: 168)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !25, line: 11, baseType: !16, size: 8, align: 8, offset: 176)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !25, line: 11, baseType: !16, size: 8, align: 8, offset: 184)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !25, line: 11, baseType: !360, size: 64, align: 64, offset: 192)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !25, line: 11, size: 64, align: 8, elements: !362)
!362 = !{!363}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !25, line: 11, baseType: !90, size: 64, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !25, line: 11, baseType: !50, size: 64, align: 64, offset: 256)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !25, line: 11, baseType: !97, size: 64, align: 64, offset: 320)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !25, line: 11, baseType: !367, size: 64, align: 64, offset: 384)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: ".reflect.uncommonType", file: !25, line: 11, size: 320, align: 8, elements: !369)
!369 = !{!370, !371, !372}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !25, line: 11, baseType: !97, size: 64, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !25, line: 11, baseType: !97, size: 64, align: 64, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !25, line: 11, baseType: !373, size: 192, align: 64, offset: 128)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.reflect.method,int,int}", file: !10, size: 192, align: 8, elements: !374)
!374 = !{!375, !57, !58}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !376, size: 64, align: 64)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: ".reflect.method", file: !25, line: 11, size: 320, align: 8, elements: !378)
!378 = !{!370, !371, !379, !380, !381}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !25, line: 11, baseType: !93, size: 64, align: 64, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !25, line: 11, baseType: !93, size: 64, align: 64, offset: 192)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !25, line: 11, baseType: !93, size: 64, align: 64, offset: 256)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !25, line: 11, baseType: !93, size: 64, align: 64, offset: 448)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", file: !25, line: 11, baseType: !93, size: 64, align: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "flag", file: !25, line: 11, baseType: !385, size: 64, align: 64, offset: 128)
!385 = !DIBasicType(name: ".reflect.flag", size: 64, encoding: DW_ATE_unsigned)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !25, line: 11, baseType: !52, size: 64, align: 64, offset: 576)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "MethodByName", file: !10, line: 11, baseType: !388, size: 64, align: 64, offset: 1280)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{!391, !93, !47}
!391 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Method,bool}", file: !10, size: 704, align: 8, elements: !392)
!392 = !{!393, !394}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 11, baseType: !342, size: 640, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 11, baseType: !13, size: 8, align: 8, offset: 640)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 11, baseType: !131, size: 64, align: 64, offset: 1344)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "NumField", file: !10, line: 11, baseType: !261, size: 64, align: 64, offset: 1408)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "NumIn", file: !10, line: 11, baseType: !261, size: 64, align: 64, offset: 1472)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "NumMethod", file: !10, line: 11, baseType: !261, size: 64, align: 64, offset: 1536)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "NumOut", file: !10, line: 11, baseType: !261, size: 64, align: 64, offset: 1600)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "Out", file: !10, line: 11, baseType: !327, size: 64, align: 64, offset: 1664)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "PkgPath", file: !10, line: 11, baseType: !131, size: 64, align: 64, offset: 1728)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "Size", file: !10, line: 11, baseType: !403, size: 64, align: 64, offset: 1792)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!77, !93}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !10, line: 11, baseType: !131, size: 64, align: 64, offset: 1856)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "common", file: !10, line: 11, baseType: !408, size: 64, align: 64, offset: 1920)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{!348, !93}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "rawString", file: !10, line: 11, baseType: !131, size: 64, align: 64, offset: 1984)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "uncommon", file: !10, line: 11, baseType: !413, size: 64, align: 64, offset: 2048)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!367, !93}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !25, line: 1, baseType: !93, size: 64, align: 64, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "Desc", file: !25, line: 14, baseType: !418, size: 128, align: 64, offset: 128)
!418 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageDescriptor", file: !25, line: 14, size: 128, align: 8, elements: !419)
!419 = !{!420, !416}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 14, baseType: !421, size: 64, align: 64)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)EnumDescriptors,*func(*void,int)ProtoMessage,*func(*void)FieldRanges,*func(*void)ExtensionDescriptors,*func(*void)FieldDescriptors,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)bool,*func(*void)MessageDescriptors,*func(*void)Name,*func(*void)OneofDescriptors,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,MessageDescriptor)void,*func(*void)FieldNumbers,*func(*void)Names,*func(*void)FieldRanges,*func(*void)Syntax}", file: !10, size: 1408, align: 8, elements: !423)
!423 = !{!72, !424, !1142, !1146, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1191, !1192, !1193, !1194, !1195, !1199, !1213, !1214, !1215}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "Enums", file: !10, line: 14, baseType: !425, size: 64, align: 64, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DISubroutineType(types: !427)
!427 = !{!428, !93}
!428 = !DICompositeType(tag: DW_TAG_structure_type, name: "EnumDescriptors", file: !25, line: 14, size: 128, align: 8, elements: !429)
!429 = !{!430, !416}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 14, baseType: !431, size: 64, align: 64)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)EnumDescriptor,*func(*void,int)EnumDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 320, align: 8, elements: !433)
!433 = !{!72, !434, !1138, !586, !587}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 14, baseType: !435, size: 64, align: 64, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{!438, !93, !455}
!438 = !DICompositeType(tag: DW_TAG_structure_type, name: "EnumDescriptor", file: !25, line: 14, size: 128, align: 8, elements: !439)
!439 = !{!440, !416}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 14, baseType: !441, size: 64, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,EnumDescriptor)void,*func(*void)Names,*func(*void)EnumRanges,*func(*void)Syntax,*func(*void)EnumValueDescriptors}", file: !10, size: 896, align: 8, elements: !443)
!443 = !{!72, !444, !449, !450, !451, !456, !1072, !563, !759, !1073, !1077, !1095, !767, !1116}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !10, line: 14, baseType: !445, size: 64, align: 64, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DISubroutineType(types: !447)
!447 = !{!448, !93}
!448 = !DICompositeType(tag: DW_TAG_structure_type, name: "FullName", file: !25, line: 14, size: 128, align: 8, elements: !291)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !10, line: 14, baseType: !261, size: 64, align: 64, offset: 128)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !10, line: 14, baseType: !207, size: 64, align: 64, offset: 192)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 14, baseType: !452, size: 64, align: 64, offset: 256)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DISubroutineType(types: !454)
!454 = !{!455, !93}
!455 = !DICompositeType(tag: DW_TAG_structure_type, name: "Name", file: !25, line: 14, size: 128, align: 8, elements: !291)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 14, baseType: !457, size: 64, align: 64, offset: 320)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!460, !93}
!460 = !DICompositeType(tag: DW_TAG_structure_type, name: "ProtoMessage", file: !25, line: 14, size: 128, align: 8, elements: !461)
!461 = !{!462, !416}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 14, baseType: !463, size: 64, align: 64)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Message}", file: !10, size: 128, align: 8, elements: !465)
!465 = !{!72, !466}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoReflect", file: !10, line: 14, baseType: !467, size: 64, align: 64, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DISubroutineType(types: !469)
!469 = !{!470, !93}
!470 = !DICompositeType(tag: DW_TAG_structure_type, name: "Message", file: !25, line: 14, size: 128, align: 8, elements: !471)
!471 = !{!472, !416}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 14, baseType: !473, size: 64, align: 64)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,FieldDescriptor)void,*func(*void)MessageDescriptor,*func(*void,FieldDescriptor)Value,*func(*void)RawFields,*func(*void,FieldDescriptor)bool,*func(*void)ProtoMessage,*func(*void)bool,*func(*void,FieldDescriptor)Value,*func(*void)Message,*func(*void,FieldDescriptor)Value,*func(*void)*struct{NoUnkeyedLiterals,uint64,*__go_descriptor,*__go_descriptor,*__go_descriptor,*__go_descriptor,*__go_descriptor},*func(*void,*__go_descriptor)void,*func(*void,FieldDescriptor,Value)void,*func(*void,RawFields)void,*func(*void)MessageType,*func(*void,OneofDescriptor)FieldDescriptor}", file: !10, size: 1088, align: 8, elements: !475)
!475 = !{!72, !476, !838, !839, !843, !850, !854, !855, !856, !857, !858, !859, !1036, !1047, !1051, !1055, !1068}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "Clear", file: !10, line: 14, baseType: !477, size: 64, align: 64, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DISubroutineType(types: !479)
!479 = !{!94, !93, !480}
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "FieldDescriptor", file: !25, line: 14, size: 128, align: 8, elements: !481)
!481 = !{!482, !416}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 14, baseType: !483, size: 64, align: 64)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Cardinality,*func(*void)MessageDescriptor,*func(*void)OneofDescriptor,*func(*void)Value,*func(*void)EnumValueDescriptor,*func(*void)EnumDescriptor,*func(*void)FullName,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)int,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)string,*func(*void)Kind,*func(*void)FieldDescriptor,*func(*void)FieldDescriptor,*func(*void)MessageDescriptor,*func(*void)Name,*func(*void)Number,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,FieldDescriptor)void,*func(*void)Syntax,*func(*void)string}", file: !10, size: 2112, align: 8, elements: !485)
!485 = !{!72, !486, !491, !495, !768, !777, !798, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !820, !824, !825, !826, !827, !831, !832, !833, !834, !835, !836, !837}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "Cardinality", file: !10, line: 14, baseType: !487, size: 64, align: 64, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DISubroutineType(types: !489)
!489 = !{!490, !93}
!490 = !DIBasicType(name: "Cardinality", size: 8, encoding: DW_ATE_signed)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "ContainingMessage", file: !10, line: 14, baseType: !492, size: 64, align: 64, offset: 128)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DISubroutineType(types: !494)
!494 = !{!418, !93}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "ContainingOneof", file: !10, line: 14, baseType: !496, size: 64, align: 64, offset: 192)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DISubroutineType(types: !498)
!498 = !{!499, !93}
!499 = !DICompositeType(tag: DW_TAG_structure_type, name: "OneofDescriptor", file: !25, line: 14, size: 128, align: 8, elements: !500)
!500 = !{!501, !416}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 14, baseType: !502, size: 64, align: 64)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FieldDescriptors,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,OneofDescriptor)void,*func(*void)Syntax}", file: !10, size: 832, align: 8, elements: !504)
!504 = !{!72, !505, !545, !546, !547, !548, !549, !550, !551, !761, !762, !763, !767}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "Fields", file: !10, line: 14, baseType: !506, size: 64, align: 64, offset: 64)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DISubroutineType(types: !508)
!508 = !{!509, !93}
!509 = !DICompositeType(tag: DW_TAG_structure_type, name: "FieldDescriptors", file: !25, line: 14, size: 128, align: 8, elements: !510)
!510 = !{!511, !416}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 14, baseType: !512, size: 64, align: 64)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string)FieldDescriptor,*func(*void,Name)FieldDescriptor,*func(*void,Number)FieldDescriptor,*func(*void,string)FieldDescriptor,*func(*void,int)FieldDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 512, align: 8, elements: !514)
!514 = !{!72, !515, !519, !523, !528, !529, !533, !534}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "ByJSONName", file: !10, line: 14, baseType: !516, size: 64, align: 64, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DISubroutineType(types: !518)
!518 = !{!480, !93, !47}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 14, baseType: !520, size: 64, align: 64, offset: 128)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DISubroutineType(types: !522)
!522 = !{!480, !93, !455}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "ByNumber", file: !10, line: 14, baseType: !524, size: 64, align: 64, offset: 192)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{!480, !93, !527}
!527 = !DIBasicType(name: "Number", size: 32, encoding: DW_ATE_signed)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "ByTextName", file: !10, line: 14, baseType: !516, size: 64, align: 64, offset: 256)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 14, baseType: !530, size: 64, align: 64, offset: 320)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DISubroutineType(types: !532)
!532 = !{!480, !93, !52}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !10, line: 14, baseType: !261, size: 64, align: 64, offset: 384)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 14, baseType: !535, size: 64, align: 64, offset: 448)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DISubroutineType(types: !537)
!537 = !{!94, !93, !538}
!538 = !DICompositeType(tag: DW_TAG_structure_type, name: "DoNotImplement", file: !25, line: 14, size: 128, align: 8, elements: !539)
!539 = !{!540, !416}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 14, baseType: !541, size: 64, align: 64)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,DoNotImplement)void}", file: !10, size: 128, align: 8, elements: !543)
!543 = !{!72, !544}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 14, baseType: !93, size: 64, align: 64, offset: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !10, line: 14, baseType: !445, size: 64, align: 64, offset: 128)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !10, line: 14, baseType: !261, size: 64, align: 64, offset: 192)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !10, line: 14, baseType: !207, size: 64, align: 64, offset: 256)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "IsSynthetic", file: !10, line: 14, baseType: !207, size: 64, align: 64, offset: 320)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 14, baseType: !452, size: 64, align: 64, offset: 384)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 14, baseType: !93, size: 64, align: 64, offset: 448)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 14, baseType: !552, size: 64, align: 64, offset: 512)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DISubroutineType(types: !554)
!554 = !{!555, !93}
!555 = !DICompositeType(tag: DW_TAG_structure_type, name: "Descriptor", file: !25, line: 14, size: 128, align: 8, elements: !556)
!556 = !{!557, !416}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 14, baseType: !558, size: 64, align: 64)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void)Syntax}", file: !10, size: 640, align: 8, elements: !560)
!560 = !{!72, !444, !449, !450, !451, !561, !562, !563, !759, !760}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 14, baseType: !93, size: 64, align: 64, offset: 320)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 14, baseType: !93, size: 64, align: 64, offset: 384)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !10, line: 14, baseType: !564, size: 64, align: 64, offset: 448)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DISubroutineType(types: !566)
!566 = !{!567, !93}
!567 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileDescriptor", file: !25, line: 14, size: 128, align: 8, elements: !568)
!568 = !{!569, !416}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 14, baseType: !570, size: 64, align: 64)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)EnumDescriptors,*func(*void)ExtensionDescriptors,*func(*void)FullName,*func(*void)FileImports,*func(*void)int,*func(*void)bool,*func(*void)MessageDescriptors,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)FullName,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void)string,*func(*void,DoNotImplement)void,*func(*void,FileDescriptor)void,*func(*void)ServiceDescriptors,*func(*void)SourceLocations,*func(*void)Syntax}", file: !10, size: 1216, align: 8, elements: !572)
!572 = !{!72, !573, !574, !588, !589, !610, !611, !612, !630, !631, !632, !633, !634, !635, !636, !637, !641, !717, !758}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "Enums", file: !10, line: 14, baseType: !93, size: 64, align: 64, offset: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "Extensions", file: !10, line: 14, baseType: !575, size: 64, align: 64, offset: 128)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DISubroutineType(types: !577)
!577 = !{!578, !93}
!578 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionDescriptors", file: !25, line: 14, size: 128, align: 8, elements: !579)
!579 = !{!580, !416}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 14, baseType: !581, size: 64, align: 64)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)FieldDescriptor,*func(*void,int)FieldDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 320, align: 8, elements: !583)
!583 = !{!72, !584, !585, !586, !587}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 14, baseType: !520, size: 64, align: 64, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 14, baseType: !530, size: 64, align: 64, offset: 128)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !10, line: 14, baseType: !261, size: 64, align: 64, offset: 192)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 14, baseType: !535, size: 64, align: 64, offset: 256)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !10, line: 14, baseType: !445, size: 64, align: 64, offset: 192)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "Imports", file: !10, line: 14, baseType: !590, size: 64, align: 64, offset: 256)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{!593, !93}
!593 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileImports", file: !25, line: 14, size: 128, align: 8, elements: !594)
!594 = !{!595, !416}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 14, baseType: !596, size: 64, align: 64)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,int)FileImport,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 256, align: 8, elements: !598)
!598 = !{!72, !599, !608, !609}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 14, baseType: !600, size: 64, align: 64, offset: 64)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DISubroutineType(types: !602)
!602 = !{!603, !93, !52}
!603 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileImport", file: !25, line: 14, size: 192, align: 8, elements: !604)
!604 = !{!605, !606, !607}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "FileDescriptor", file: !25, line: 14, baseType: !567, size: 128, align: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "IsPublic", file: !25, line: 14, baseType: !13, size: 8, align: 8, offset: 128)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "IsWeak", file: !25, line: 14, baseType: !13, size: 8, align: 8, offset: 136)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !10, line: 14, baseType: !261, size: 64, align: 64, offset: 128)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 14, baseType: !535, size: 64, align: 64, offset: 192)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !10, line: 14, baseType: !261, size: 64, align: 64, offset: 320)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !10, line: 14, baseType: !207, size: 64, align: 64, offset: 384)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "Messages", file: !10, line: 14, baseType: !613, size: 64, align: 64, offset: 448)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DISubroutineType(types: !615)
!615 = !{!616, !93}
!616 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageDescriptors", file: !25, line: 14, size: 128, align: 8, elements: !617)
!617 = !{!618, !416}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 14, baseType: !619, size: 64, align: 64)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)MessageDescriptor,*func(*void,int)MessageDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 320, align: 8, elements: !621)
!621 = !{!72, !622, !626, !586, !587}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 14, baseType: !623, size: 64, align: 64, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DISubroutineType(types: !625)
!625 = !{!418, !93, !455}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 14, baseType: !627, size: 64, align: 64, offset: 128)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DISubroutineType(types: !629)
!629 = !{!418, !93, !52}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 14, baseType: !452, size: 64, align: 64, offset: 512)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 14, baseType: !93, size: 64, align: 64, offset: 576)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "Package", file: !10, line: 14, baseType: !445, size: 64, align: 64, offset: 640)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 14, baseType: !93, size: 64, align: 64, offset: 704)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !10, line: 14, baseType: !93, size: 64, align: 64, offset: 768)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !10, line: 14, baseType: !131, size: 64, align: 64, offset: 832)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 14, baseType: !535, size: 64, align: 64, offset: 896)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !10, line: 14, baseType: !638, size: 64, align: 64, offset: 960)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DISubroutineType(types: !640)
!640 = !{!94, !93, !567}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "Services", file: !10, line: 14, baseType: !642, size: 64, align: 64, offset: 1024)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DISubroutineType(types: !644)
!644 = !{!645, !93}
!645 = !DICompositeType(tag: DW_TAG_structure_type, name: "ServiceDescriptors", file: !25, line: 14, size: 128, align: 8, elements: !646)
!646 = !{!647, !416}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 14, baseType: !648, size: 64, align: 64)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)ServiceDescriptor,*func(*void,int)ServiceDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 320, align: 8, elements: !650)
!650 = !{!72, !651, !713, !586, !587}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 14, baseType: !652, size: 64, align: 64, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DISubroutineType(types: !654)
!654 = !{!655, !93, !455}
!655 = !DICompositeType(tag: DW_TAG_structure_type, name: "ServiceDescriptor", file: !25, line: 14, size: 128, align: 8, elements: !656)
!656 = !{!657, !416}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 14, baseType: !658, size: 64, align: 64)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)MethodDescriptors,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,ServiceDescriptor)void,*func(*void)Syntax}", file: !10, size: 768, align: 8, elements: !660)
!660 = !{!72, !444, !449, !450, !661, !703, !704, !705, !706, !707, !708, !712}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", file: !10, line: 14, baseType: !662, size: 64, align: 64, offset: 256)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DISubroutineType(types: !664)
!664 = !{!665, !93}
!665 = !DICompositeType(tag: DW_TAG_structure_type, name: "MethodDescriptors", file: !25, line: 14, size: 128, align: 8, elements: !666)
!666 = !{!667, !416}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 14, baseType: !668, size: 64, align: 64)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)MethodDescriptor,*func(*void,int)MethodDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 320, align: 8, elements: !670)
!670 = !{!72, !671, !699, !586, !587}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 14, baseType: !672, size: 64, align: 64, offset: 64)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DISubroutineType(types: !674)
!674 = !{!675, !93, !455}
!675 = !DICompositeType(tag: DW_TAG_structure_type, name: "MethodDescriptor", file: !25, line: 14, size: 128, align: 8, elements: !676)
!676 = !{!677, !416}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 14, baseType: !678, size: 64, align: 64)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)MessageDescriptor,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)MessageDescriptor,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,MethodDescriptor)void,*func(*void)Syntax}", file: !10, size: 960, align: 8, elements: !680)
!680 = !{!72, !444, !449, !681, !547, !682, !683, !684, !685, !686, !687, !688, !689, !690, !694}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "Input", file: !10, line: 14, baseType: !492, size: 64, align: 64, offset: 192)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "IsStreamingClient", file: !10, line: 14, baseType: !207, size: 64, align: 64, offset: 320)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "IsStreamingServer", file: !10, line: 14, baseType: !207, size: 64, align: 64, offset: 384)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 14, baseType: !452, size: 64, align: 64, offset: 448)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 14, baseType: !93, size: 64, align: 64, offset: 512)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "Output", file: !10, line: 14, baseType: !492, size: 64, align: 64, offset: 576)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 14, baseType: !93, size: 64, align: 64, offset: 640)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !10, line: 14, baseType: !93, size: 64, align: 64, offset: 704)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 14, baseType: !535, size: 64, align: 64, offset: 768)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !10, line: 14, baseType: !691, size: 64, align: 64, offset: 832)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DISubroutineType(types: !693)
!693 = !{!94, !93, !675}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !10, line: 14, baseType: !695, size: 64, align: 64, offset: 896)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DISubroutineType(types: !697)
!697 = !{!698, !93}
!698 = !DIBasicType(name: "Syntax", size: 8, encoding: DW_ATE_signed)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 14, baseType: !700, size: 64, align: 64, offset: 128)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DISubroutineType(types: !702)
!702 = !{!675, !93, !52}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 14, baseType: !452, size: 64, align: 64, offset: 320)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 14, baseType: !93, size: 64, align: 64, offset: 384)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 14, baseType: !93, size: 64, align: 64, offset: 448)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !10, line: 14, baseType: !93, size: 64, align: 64, offset: 512)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 14, baseType: !535, size: 64, align: 64, offset: 576)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !10, line: 14, baseType: !709, size: 64, align: 64, offset: 640)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DISubroutineType(types: !711)
!711 = !{!94, !93, !655}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !10, line: 14, baseType: !695, size: 64, align: 64, offset: 704)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 14, baseType: !714, size: 64, align: 64, offset: 128)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DISubroutineType(types: !716)
!716 = !{!655, !93, !52}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "SourceLocations", file: !10, line: 14, baseType: !718, size: 64, align: 64, offset: 1088)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{!721, !93}
!721 = !DICompositeType(tag: DW_TAG_structure_type, name: "SourceLocations", file: !25, line: 14, size: 128, align: 8, elements: !722)
!722 = !{!723, !416}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 14, baseType: !724, size: 64, align: 64)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Descriptor)SourceLocation,*func(*void,SourcePath)SourceLocation,*func(*void,int)SourceLocation,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 384, align: 8, elements: !726)
!726 = !{!72, !727, !748, !752, !756, !757}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "ByDescriptor", file: !10, line: 14, baseType: !728, size: 64, align: 64, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DISubroutineType(types: !730)
!730 = !{!731, !93, !555}
!731 = !DICompositeType(tag: DW_TAG_structure_type, name: "SourceLocation", file: !25, line: 14, size: 960, align: 8, elements: !732)
!732 = !{!733, !740, !741, !742, !743, !744, !745, !746, !747}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !25, line: 14, baseType: !734, size: 192, align: 64)
!734 = !DICompositeType(tag: DW_TAG_structure_type, name: "SourcePath", file: !25, line: 14, size: 192, align: 8, elements: !735)
!735 = !{!736, !738, !739}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !25, line: 1, baseType: !737, size: 64, align: 64)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !25, line: 1, baseType: !52, size: 64, align: 64, offset: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !25, line: 1, baseType: !52, size: 64, align: 64, offset: 128)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "StartLine", file: !25, line: 14, baseType: !52, size: 64, align: 64, offset: 192)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "StartColumn", file: !25, line: 14, baseType: !52, size: 64, align: 64, offset: 256)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "EndLine", file: !25, line: 14, baseType: !52, size: 64, align: 64, offset: 320)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "EndColumn", file: !25, line: 14, baseType: !52, size: 64, align: 64, offset: 384)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "LeadingDetachedComments", file: !25, line: 14, baseType: !135, size: 192, align: 64, offset: 448)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "LeadingComments", file: !25, line: 14, baseType: !47, size: 128, align: 64, offset: 640)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "TrailingComments", file: !25, line: 14, baseType: !47, size: 128, align: 64, offset: 768)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "Next", file: !25, line: 14, baseType: !52, size: 64, align: 64, offset: 896)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "ByPath", file: !10, line: 14, baseType: !749, size: 64, align: 64, offset: 128)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{!731, !93, !734}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 14, baseType: !753, size: 64, align: 64, offset: 192)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DISubroutineType(types: !755)
!755 = !{!731, !93, !52}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !10, line: 14, baseType: !261, size: 64, align: 64, offset: 256)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 14, baseType: !535, size: 64, align: 64, offset: 320)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !10, line: 14, baseType: !695, size: 64, align: 64, offset: 1152)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 14, baseType: !535, size: 64, align: 64, offset: 512)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !10, line: 14, baseType: !695, size: 64, align: 64, offset: 576)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !10, line: 14, baseType: !564, size: 64, align: 64, offset: 576)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 14, baseType: !535, size: 64, align: 64, offset: 640)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !10, line: 14, baseType: !764, size: 64, align: 64, offset: 704)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DISubroutineType(types: !766)
!766 = !{!94, !93, !499}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !10, line: 14, baseType: !695, size: 64, align: 64, offset: 768)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "Default", file: !10, line: 14, baseType: !769, size: 64, align: 64, offset: 256)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DISubroutineType(types: !771)
!771 = !{!772, !93}
!772 = !DICompositeType(tag: DW_TAG_structure_type, name: "Value", file: !25, line: 14, size: 192, align: 8, elements: !773)
!773 = !{!231, !774, !775, !776}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !25, line: 14, baseType: !93, size: 64, align: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", file: !25, line: 14, baseType: !93, size: 64, align: 64, offset: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "num", file: !25, line: 14, baseType: !22, size: 64, align: 64, offset: 128)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "DefaultEnumValue", file: !10, line: 14, baseType: !778, size: 64, align: 64, offset: 320)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DISubroutineType(types: !780)
!780 = !{!781, !93}
!781 = !DICompositeType(tag: DW_TAG_structure_type, name: "EnumValueDescriptor", file: !25, line: 14, size: 128, align: 8, elements: !782)
!782 = !{!783, !416}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 14, baseType: !784, size: 64, align: 64)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)Name,*func(*void)EnumNumber,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,EnumValueDescriptor)void,*func(*void)Syntax}", file: !10, size: 768, align: 8, elements: !786)
!786 = !{!72, !444, !449, !450, !451, !787, !704, !792, !793, !707, !794, !712}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "Number", file: !10, line: 14, baseType: !788, size: 64, align: 64, offset: 320)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DISubroutineType(types: !790)
!790 = !{!791, !93}
!791 = !DIBasicType(name: "EnumNumber", size: 32, encoding: DW_ATE_signed)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 14, baseType: !552, size: 64, align: 64, offset: 448)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !10, line: 14, baseType: !564, size: 64, align: 64, offset: 512)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !10, line: 14, baseType: !795, size: 64, align: 64, offset: 640)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DISubroutineType(types: !797)
!797 = !{!94, !93, !781}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "Enum", file: !10, line: 14, baseType: !799, size: 64, align: 64, offset: 384)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DISubroutineType(types: !801)
!801 = !{!438, !93}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !10, line: 14, baseType: !445, size: 64, align: 64, offset: 448)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "HasDefault", file: !10, line: 14, baseType: !207, size: 64, align: 64, offset: 512)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "HasJSONName", file: !10, line: 14, baseType: !207, size: 64, align: 64, offset: 576)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "HasOptionalKeyword", file: !10, line: 14, baseType: !207, size: 64, align: 64, offset: 640)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "HasPresence", file: !10, line: 14, baseType: !207, size: 64, align: 64, offset: 704)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !10, line: 14, baseType: !261, size: 64, align: 64, offset: 768)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "IsExtension", file: !10, line: 14, baseType: !207, size: 64, align: 64, offset: 832)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "IsList", file: !10, line: 14, baseType: !207, size: 64, align: 64, offset: 896)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "IsMap", file: !10, line: 14, baseType: !207, size: 64, align: 64, offset: 960)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "IsPacked", file: !10, line: 14, baseType: !207, size: 64, align: 64, offset: 1024)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !10, line: 14, baseType: !207, size: 64, align: 64, offset: 1088)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "IsWeak", file: !10, line: 14, baseType: !207, size: 64, align: 64, offset: 1152)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "JSONName", file: !10, line: 14, baseType: !131, size: 64, align: 64, offset: 1216)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "Kind", file: !10, line: 14, baseType: !816, size: 64, align: 64, offset: 1280)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DISubroutineType(types: !818)
!818 = !{!819, !93}
!819 = !DIBasicType(name: "Kind", size: 8, encoding: DW_ATE_signed)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "MapKey", file: !10, line: 14, baseType: !821, size: 64, align: 64, offset: 1344)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DISubroutineType(types: !823)
!823 = !{!480, !93}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "MapValue", file: !10, line: 14, baseType: !821, size: 64, align: 64, offset: 1408)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "Message", file: !10, line: 14, baseType: !492, size: 64, align: 64, offset: 1472)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 14, baseType: !452, size: 64, align: 64, offset: 1536)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "Number", file: !10, line: 14, baseType: !828, size: 64, align: 64, offset: 1600)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DISubroutineType(types: !830)
!830 = !{!527, !93}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 14, baseType: !93, size: 64, align: 64, offset: 1664)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 14, baseType: !552, size: 64, align: 64, offset: 1728)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !10, line: 14, baseType: !564, size: 64, align: 64, offset: 1792)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 14, baseType: !535, size: 64, align: 64, offset: 1856)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !10, line: 14, baseType: !93, size: 64, align: 64, offset: 1920)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !10, line: 14, baseType: !695, size: 64, align: 64, offset: 1984)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "TextName", file: !10, line: 14, baseType: !131, size: 64, align: 64, offset: 2048)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "Descriptor", file: !10, line: 14, baseType: !492, size: 64, align: 64, offset: 128)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 14, baseType: !840, size: 64, align: 64, offset: 192)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DISubroutineType(types: !842)
!842 = !{!772, !93, !480}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "GetUnknown", file: !10, line: 14, baseType: !844, size: 64, align: 64, offset: 256)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DISubroutineType(types: !846)
!846 = !{!847, !93}
!847 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawFields", file: !25, line: 14, size: 192, align: 8, elements: !848)
!848 = !{!849, !738, !739}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !25, line: 1, baseType: !50, size: 64, align: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "Has", file: !10, line: 14, baseType: !851, size: 64, align: 64, offset: 320)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DISubroutineType(types: !853)
!853 = !{!13, !93, !480}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "Interface", file: !10, line: 14, baseType: !93, size: 64, align: 64, offset: 384)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "IsValid", file: !10, line: 14, baseType: !207, size: 64, align: 64, offset: 448)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "Mutable", file: !10, line: 14, baseType: !840, size: 64, align: 64, offset: 512)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "New", file: !10, line: 14, baseType: !93, size: 64, align: 64, offset: 576)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "NewField", file: !10, line: 14, baseType: !840, size: 64, align: 64, offset: 640)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMethods", file: !10, line: 14, baseType: !860, size: 64, align: 64, offset: 704)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DISubroutineType(types: !862)
!862 = !{!863, !93}
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{NoUnkeyedLiterals,uint64,*__go_descriptor,*__go_descriptor,*__go_descriptor,*__go_descriptor,*__go_descriptor}", file: !10, size: 384, align: 8, elements: !865)
!865 = !{!866, !867, !868, !883, !902, !1008, !1020}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "NoUnkeyedLiterals", file: !10, line: 14, baseType: !230, align: 8)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", file: !10, line: 14, baseType: !22, size: 64, align: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "Size", file: !10, line: 14, baseType: !869, size: 64, align: 64, offset: 64)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !25, line: 14, size: 64, align: 8, elements: !871)
!871 = !{!872}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !25, line: 14, baseType: !873, size: 64, align: 64)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DISubroutineType(types: !875)
!875 = !{!876, !879}
!876 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{NoUnkeyedLiterals,int}", file: !10, size: 64, align: 8, elements: !877)
!877 = !{!866, !878}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "Size", file: !10, line: 14, baseType: !52, size: 64, align: 64)
!879 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{NoUnkeyedLiterals,Message,uint8}", file: !10, size: 192, align: 8, elements: !880)
!880 = !{!866, !881, !882}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "Message", file: !10, line: 14, baseType: !470, size: 128, align: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", file: !10, line: 14, baseType: !16, size: 8, align: 8, offset: 128)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "Marshal", file: !10, line: 14, baseType: !884, size: 64, align: 64, offset: 128)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !25, line: 14, size: 64, align: 8, elements: !886)
!886 = !{!887}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !25, line: 14, baseType: !888, size: 64, align: 64)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DISubroutineType(types: !890)
!890 = !{!891, !898}
!891 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{NoUnkeyedLiterals,struct{*uint8,int,int}},error}", file: !10, size: 320, align: 8, elements: !892)
!892 = !{!893, !897}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 14, baseType: !894, size: 192, align: 64)
!894 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{NoUnkeyedLiterals,struct{*uint8,int,int}}", file: !10, size: 192, align: 8, elements: !895)
!895 = !{!866, !896}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "Buf", file: !10, line: 14, baseType: !54, size: 192, align: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 14, baseType: !123, size: 128, align: 64, offset: 192)
!898 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{NoUnkeyedLiterals,Message,struct{*uint8,int,int},uint8}", file: !10, size: 384, align: 8, elements: !899)
!899 = !{!866, !881, !900, !901}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "Buf", file: !10, line: 14, baseType: !54, size: 192, align: 64, offset: 128)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", file: !10, line: 14, baseType: !16, size: 8, align: 8, offset: 320)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "Unmarshal", file: !10, line: 14, baseType: !903, size: 64, align: 64, offset: 192)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !25, line: 14, size: 64, align: 8, elements: !905)
!905 = !{!906}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !25, line: 14, baseType: !907, size: 64, align: 64)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DISubroutineType(types: !909)
!909 = !{!910, !917}
!910 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{NoUnkeyedLiterals,uint8},error}", file: !10, size: 192, align: 8, elements: !911)
!911 = !{!912, !916}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 14, baseType: !913, size: 8, align: 8)
!913 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{NoUnkeyedLiterals,uint8}", file: !10, size: 8, align: 1, elements: !914)
!914 = !{!866, !915}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", file: !10, line: 14, baseType: !16, size: 8, align: 8)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 14, baseType: !123, size: 128, align: 64, offset: 64)
!917 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{NoUnkeyedLiterals,Message,struct{*uint8,int,int},uint8,struct{*struct{*_type,*func(*void,FullName)struct{ExtensionType,error},*func(*void,FullName,Number)struct{ExtensionType,error}},*void},int}", file: !10, size: 576, align: 8, elements: !918)
!918 = !{!866, !881, !900, !901, !919, !1007}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "Resolver", file: !10, line: 14, baseType: !920, size: 128, align: 64, offset: 384)
!920 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*_type,*func(*void,FullName)struct{ExtensionType,error},*func(*void,FullName,Number)struct{ExtensionType,error}},*void}", file: !10, size: 128, align: 8, elements: !921)
!921 = !{!922, !1006}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 14, baseType: !923, size: 64, align: 64)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,FullName)struct{ExtensionType,error},*func(*void,FullName,Number)struct{ExtensionType,error}}", file: !10, size: 192, align: 8, elements: !925)
!925 = !{!72, !926, !1002}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "FindExtensionByName", file: !10, line: 14, baseType: !927, size: 64, align: 64, offset: 64)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DISubroutineType(types: !929)
!929 = !{!930, !93, !448}
!930 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{ExtensionType,error}", file: !10, size: 256, align: 8, elements: !931)
!931 = !{!932, !122}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 14, baseType: !933, size: 128, align: 64)
!933 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionType", file: !25, line: 14, size: 128, align: 8, elements: !934)
!934 = !{!935, !416}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 14, baseType: !936, size: 64, align: 64)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Value)any,*func(*void,any)bool,*func(*void,Value)bool,*func(*void)Value,*func(*void)ExtensionTypeDescriptor,*func(*void,any)Value,*func(*void)Value}", file: !10, size: 512, align: 8, elements: !938)
!938 = !{!72, !939, !946, !950, !954, !955, !997, !1001}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "InterfaceOf", file: !10, line: 14, baseType: !940, size: 64, align: 64, offset: 64)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DISubroutineType(types: !942)
!942 = !{!943, !93, !772}
!943 = !DICompositeType(tag: DW_TAG_structure_type, name: "any", file: !25, line: 15, size: 128, align: 8, elements: !944)
!944 = !{!945, !416}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !25, line: 1, baseType: !73, size: 64, align: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "IsValidInterface", file: !10, line: 14, baseType: !947, size: 64, align: 64, offset: 128)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DISubroutineType(types: !949)
!949 = !{!13, !93, !943}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "IsValidValue", file: !10, line: 14, baseType: !951, size: 64, align: 64, offset: 192)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DISubroutineType(types: !953)
!953 = !{!13, !93, !772}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "New", file: !10, line: 14, baseType: !769, size: 64, align: 64, offset: 256)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "TypeDescriptor", file: !10, line: 14, baseType: !956, size: 64, align: 64, offset: 320)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = !DISubroutineType(types: !958)
!958 = !{!959, !93}
!959 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionTypeDescriptor", file: !25, line: 14, size: 128, align: 8, elements: !960)
!960 = !{!961, !416}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 14, baseType: !962, size: 64, align: 64)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Cardinality,*func(*void)MessageDescriptor,*func(*void)OneofDescriptor,*func(*void)Value,*func(*void)EnumValueDescriptor,*func(*void)FieldDescriptor,*func(*void)EnumDescriptor,*func(*void)FullName,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)int,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)string,*func(*void)Kind,*func(*void)FieldDescriptor,*func(*void)FieldDescriptor,*func(*void)MessageDescriptor,*func(*void)Name,*func(*void)Number,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,FieldDescriptor)void,*func(*void)Syntax,*func(*void)string,*func(*void)ExtensionType}", file: !10, size: 2240, align: 8, elements: !964)
!964 = !{!72, !486, !491, !495, !768, !777, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "Descriptor", file: !10, line: 14, baseType: !821, size: 64, align: 64, offset: 384)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "Enum", file: !10, line: 14, baseType: !799, size: 64, align: 64, offset: 448)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !10, line: 14, baseType: !445, size: 64, align: 64, offset: 512)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "HasDefault", file: !10, line: 14, baseType: !207, size: 64, align: 64, offset: 576)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "HasJSONName", file: !10, line: 14, baseType: !207, size: 64, align: 64, offset: 640)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "HasOptionalKeyword", file: !10, line: 14, baseType: !207, size: 64, align: 64, offset: 704)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "HasPresence", file: !10, line: 14, baseType: !207, size: 64, align: 64, offset: 768)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !10, line: 14, baseType: !261, size: 64, align: 64, offset: 832)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "IsExtension", file: !10, line: 14, baseType: !207, size: 64, align: 64, offset: 896)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "IsList", file: !10, line: 14, baseType: !207, size: 64, align: 64, offset: 960)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "IsMap", file: !10, line: 14, baseType: !207, size: 64, align: 64, offset: 1024)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "IsPacked", file: !10, line: 14, baseType: !207, size: 64, align: 64, offset: 1088)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !10, line: 14, baseType: !207, size: 64, align: 64, offset: 1152)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "IsWeak", file: !10, line: 14, baseType: !207, size: 64, align: 64, offset: 1216)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "JSONName", file: !10, line: 14, baseType: !131, size: 64, align: 64, offset: 1280)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "Kind", file: !10, line: 14, baseType: !816, size: 64, align: 64, offset: 1344)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "MapKey", file: !10, line: 14, baseType: !821, size: 64, align: 64, offset: 1408)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "MapValue", file: !10, line: 14, baseType: !821, size: 64, align: 64, offset: 1472)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "Message", file: !10, line: 14, baseType: !492, size: 64, align: 64, offset: 1536)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 14, baseType: !452, size: 64, align: 64, offset: 1600)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "Number", file: !10, line: 14, baseType: !828, size: 64, align: 64, offset: 1664)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 14, baseType: !93, size: 64, align: 64, offset: 1728)
