; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v3;\\n\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22test\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22shim\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.x2ecom/hyperledger/fabric-chaincode-go/shim\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22github.com/hyperledger/fabric-chaincode-go/shim\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22peer\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.x2ecom/hyperledger/fabric-protos-go/peer\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22github.com/hyperledger/fabric-protos-go/peer\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22indirectimport \22"
module asm "\09.ascii \22proto\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"Dwarf Version", i32 4}
!3 = distinct !DICompileUnit(language: DW_LANG_Go, file: !4, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !5)
!4 = !DIFile(filename: "./testCode.go", directory: "/gocodes/errPrivacyLeak")
!5 = !{}
!6 = distinct !DISubprogram(name: "test.Init..1command-line-arguments.BadChaincode", linkageName: "command..z2dline..z2darguments.BadChaincode.Init", scope: null, file: !7, line: 16, type: !8, scopeLine: 16, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!7 = !DIFile(filename: "testCode.go", directory: ".")
!8 = !DISubroutineType(types: !9)
!9 = !{!10, !34, !34, !36}
!10 = !DICompositeType(tag: DW_TAG_structure_type, name: "Response", file: !7, line: 10, size: 640, align: 8, elements: !11)
!11 = !{!12, !14, !23, !30, !32, !33}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "Status", file: !7, line: 10, baseType: !13, size: 32, align: 32)
!13 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "Message", file: !7, line: 10, baseType: !15, size: 128, align: 64, offset: 64)
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !16, line: 1, size: 128, align: 8, elements: !17)
!16 = !DIFile(filename: "<built-in>", directory: "")
!17 = !{!18, !21}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !16, line: 1, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !16, line: 1, baseType: !22, size: 64, align: 64, offset: 64)
!22 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "Payload", file: !7, line: 10, baseType: !24, size: 192, align: 64, offset: 192)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !25, size: 192, align: 8, elements: !26)
!25 = !DIFile(filename: "", directory: "")
!26 = !{!27, !28, !29}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !25, line: 1, baseType: !19, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !25, line: 1, baseType: !22, size: 64, align: 64, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !25, line: 1, baseType: !22, size: 64, align: 64, offset: 128)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_NoUnkeyedLiteral", file: !7, line: 10, baseType: !31, align: 8, offset: 384)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !16, line: 1, align: 8, elements: !5)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !7, line: 10, baseType: !24, size: 192, align: 64, offset: 384)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_sizecache", file: !7, line: 10, baseType: !13, size: 32, align: 32, offset: 576)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "BadChaincode", file: !7, line: 14, align: 8, elements: !5)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "ChaincodeStubInterface", file: !7, line: 10, size: 128, align: 8, elements: !37)
!37 = !{!38, !208}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 10, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string,struct{*string,int,int})struct{string,error},*func(*void,string,string)error,*func(*void,string)error,*func(*void)struct{*struct{*uint8,int,int},int,int},*func(*void)struct{struct{*uint8,int,int},error},*func(*void)struct{struct{*uint8,int,int},error},*func(*void)string,*func(*void)struct{struct{*uint8,int,int},error},*func(*void)Values,*func(*void)struct{string,struct{*string,int,int}},*func(*void,string)struct{HistoryQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string,string,struct{*string,int,int})struct{StateQueryIteratorInterface,error},*func(*void,string,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string)struct{StateQueryIteratorInterface,error},*func(*void,string,int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void)struct{*SignedProposal,error},*func(*void,string)struct{struct{*uint8,int,int},error},*func(*void,string,struct{*string,int,int})struct{StateQueryIteratorInterface,error},*func(*void,string,struct{*string,int,int},int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string,int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void,string)struct{struct{*uint8,int,int},error},*func(*void)struct{*string,int,int},*func(*void)struct{Values,error},*func(*void)string,*func(*void)struct{*Timestamp,error},*func(*void,string,struct{*struct{*uint8,int,int},int,int},string)Response,*func(*void,string,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string)struct{string,struct{*string,int,int},error}}", file: !25, size: 2432, align: 8, elements: !41)
!41 = !{!42, !86, !109, !113, !117, !125, !133, !134, !135, !136, !153, !160, !209, !213, !240, !244, !245, !249, !250, !254, !270, !282, !286, !290, !294, !295, !299, !300, !304, !311, !312, !319, !323, !327, !331, !332, !333, !334}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !25, line: 10, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !16, line: 1, size: 512, align: 8, elements: !45)
!45 = !{!46, !48, !49, !51, !52, !53, !54, !55, !66, !67, !69, !85}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !16, line: 1, baseType: !47, size: 64, align: 64)
!47 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !16, line: 1, baseType: !47, size: 64, align: 64, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !16, line: 1, baseType: !50, size: 32, align: 32, offset: 128)
!50 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !16, line: 1, baseType: !20, size: 8, align: 8, offset: 160)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !16, line: 1, baseType: !20, size: 8, align: 8, offset: 168)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !16, line: 1, baseType: !20, size: 8, align: 8, offset: 176)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !16, line: 1, baseType: !20, size: 8, align: 8, offset: 184)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !16, line: 1, baseType: !56, size: 64, align: 64, offset: 192)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !16, line: 1, size: 64, align: 8, elements: !58)
!58 = !{!59}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !16, line: 1, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{!63, !64, !64}
!63 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIBasicType(name: "void")
!66 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !16, line: 1, baseType: !19, size: 64, align: 64, offset: 256)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !16, line: 1, baseType: !68, size: 64, align: 64, offset: 320)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !16, line: 1, baseType: !70, size: 64, align: 64, offset: 384)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !16, line: 1, size: 320, align: 8, elements: !72)
!72 = !{!73, !74, !75}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !16, line: 1, baseType: !68, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !16, line: 1, baseType: !68, size: 64, align: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !16, line: 1, baseType: !76, size: 192, align: 64, offset: 128)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !25, size: 192, align: 8, elements: !77)
!77 = !{!78, !28, !29}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !25, line: 1, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !16, line: 1, size: 320, align: 8, elements: !81)
!81 = !{!73, !74, !82, !83, !84}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !16, line: 1, baseType: !64, size: 64, align: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !16, line: 1, baseType: !64, size: 64, align: 64, offset: 192)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !16, line: 1, baseType: !64, size: 64, align: 64, offset: 256)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !16, line: 1, baseType: !64, size: 64, align: 64, offset: 448)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "CreateCompositeKey", file: !25, line: 10, baseType: !87, size: 64, align: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DISubroutineType(types: !89)
!89 = !{!90, !64, !15, !106}
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,error}", file: !25, size: 256, align: 8, elements: !91)
!91 = !{!92, !93}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !25, line: 10, baseType: !15, size: 128, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !25, line: 10, baseType: !94, size: 128, align: 64, offset: 128)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !16, line: 1, size: 128, align: 8, elements: !95)
!95 = !{!96, !105}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !16, line: 1, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !25, size: 128, align: 8, elements: !99)
!99 = !{!100, !101}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !25, line: 1, baseType: !43, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !25, line: 1, baseType: !102, size: 64, align: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{!15, !64}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !16, line: 1, baseType: !64, size: 64, align: 64, offset: 64)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !25, size: 192, align: 8, elements: !107)
!107 = !{!108, !28, !29}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !25, line: 1, baseType: !68, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "DelPrivateData", file: !25, line: 10, baseType: !110, size: 64, align: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!94, !64, !15, !15}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "DelState", file: !25, line: 10, baseType: !114, size: 64, align: 64, offset: 192)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{!94, !64, !15}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "GetArgs", file: !25, line: 10, baseType: !118, size: 64, align: 64, offset: 256)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{!121, !64}
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*uint8,int,int},int,int}", file: !25, size: 192, align: 8, elements: !122)
!122 = !{!123, !28, !29}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !25, line: 1, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "GetArgsSlice", file: !25, line: 10, baseType: !126, size: 64, align: 64, offset: 320)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!129, !64}
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*uint8,int,int},error}", file: !25, size: 320, align: 8, elements: !130)
!130 = !{!131, !132}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !25, line: 11, baseType: !24, size: 192, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !25, line: 11, baseType: !94, size: 128, align: 64, offset: 192)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "GetBinding", file: !25, line: 10, baseType: !126, size: 64, align: 64, offset: 384)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "GetChannelID", file: !25, line: 10, baseType: !102, size: 64, align: 64, offset: 448)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "GetCreator", file: !25, line: 10, baseType: !126, size: 64, align: 64, offset: 512)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "GetDecorations", file: !25, line: 10, baseType: !137, size: 64, align: 64, offset: 576)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!140, !64}
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !16, line: 1, size: 384, align: 8, elements: !142)
!142 = !{!143, !144, !145, !146, !148, !149, !150, !151, !152}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !16, line: 1, baseType: !22, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !16, line: 1, baseType: !20, size: 8, align: 8, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !16, line: 1, baseType: !20, size: 8, align: 8, offset: 72)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !16, line: 1, baseType: !147, size: 16, align: 16, offset: 80)
!147 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !16, line: 1, baseType: !50, size: 32, align: 32, offset: 96)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !16, line: 1, baseType: !64, size: 64, align: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !16, line: 1, baseType: !64, size: 64, align: 64, offset: 192)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !16, line: 1, baseType: !47, size: 64, align: 64, offset: 256)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !16, line: 1, baseType: !64, size: 64, align: 64, offset: 320)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "GetFunctionAndParameters", file: !25, line: 10, baseType: !154, size: 64, align: 64, offset: 640)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{!157, !64}
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,struct{*string,int,int}}", file: !25, size: 320, align: 8, elements: !158)
!158 = !{!92, !159}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !25, line: 10, baseType: !106, size: 192, align: 64, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "GetHistoryForKey", file: !25, line: 10, baseType: !161, size: 64, align: 64, offset: 704)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{!164, !64, !15}
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{HistoryQueryIteratorInterface,error}", file: !25, size: 256, align: 8, elements: !165)
!165 = !{!166, !93}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !25, line: 10, baseType: !167, size: 128, align: 64)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "HistoryQueryIteratorInterface", file: !7, line: 10, size: 128, align: 8, elements: !168)
!168 = !{!169, !208}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 10, baseType: !170, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void)bool,*func(*void)struct{*KeyModification,error}}", file: !25, size: 256, align: 8, elements: !172)
!172 = !{!42, !173, !177, !181}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !25, line: 10, baseType: !174, size: 64, align: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{!94, !64}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "HasNext", file: !25, line: 10, baseType: !178, size: 64, align: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{!63, !64}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "Next", file: !25, line: 10, baseType: !182, size: 64, align: 64, offset: 192)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!185, !64}
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*KeyModification,error}", file: !25, size: 192, align: 8, elements: !186)
!186 = !{!187, !207}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !25, line: 10, baseType: !188, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "KeyModification", file: !7, line: 10, size: 704, align: 8, elements: !190)
!190 = !{!191, !192, !193, !203, !204, !205, !206}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "TxId", file: !7, line: 10, baseType: !15, size: 128, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !7, line: 10, baseType: !24, size: 192, align: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "Timestamp", file: !7, line: 10, baseType: !194, size: 64, align: 64, offset: 320)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "Timestamp", file: !7, line: 10, size: 384, align: 8, elements: !196)
!196 = !{!197, !199, !200, !201, !202}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "Seconds", file: !7, line: 10, baseType: !198, size: 64, align: 64)
!198 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "Nanos", file: !7, line: 10, baseType: !13, size: 32, align: 32, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_NoUnkeyedLiteral", file: !7, line: 10, baseType: !31, align: 8, offset: 96)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !7, line: 10, baseType: !24, size: 192, align: 64, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_sizecache", file: !7, line: 10, baseType: !13, size: 32, align: 32, offset: 320)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "IsDelete", file: !7, line: 10, baseType: !63, size: 8, align: 8, offset: 384)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_NoUnkeyedLiteral", file: !7, line: 10, baseType: !31, align: 8, offset: 392)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !7, line: 10, baseType: !24, size: 192, align: 64, offset: 448)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_sizecache", file: !7, line: 10, baseType: !13, size: 32, align: 32, offset: 640)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !25, line: 10, baseType: !94, size: 128, align: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !64, size: 64, align: 64, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "GetPrivateData", file: !25, line: 10, baseType: !210, size: 64, align: 64, offset: 768)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!129, !64, !15, !15}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "GetPrivateDataByPartialCompositeKey", file: !25, line: 10, baseType: !214, size: 64, align: 64, offset: 832)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{!217, !64, !15, !15, !106}
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{StateQueryIteratorInterface,error}", file: !25, size: 256, align: 8, elements: !218)
!218 = !{!219, !93}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !25, line: 10, baseType: !220, size: 128, align: 64)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "StateQueryIteratorInterface", file: !7, line: 10, size: 128, align: 8, elements: !221)
!221 = !{!222, !208}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 10, baseType: !223, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void)bool,*func(*void)struct{*KV,error}}", file: !25, size: 256, align: 8, elements: !225)
!225 = !{!42, !173, !177, !226}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "Next", file: !25, line: 10, baseType: !227, size: 64, align: 64, offset: 192)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{!230, !64}
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*KV,error}", file: !25, size: 192, align: 8, elements: !231)
!231 = !{!232, !207}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !25, line: 10, baseType: !233, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DICompositeType(tag: DW_TAG_structure_type, name: "KV", file: !7, line: 10, size: 704, align: 8, elements: !235)
!235 = !{!236, !237, !238, !239, !205, !206}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "Namespace", file: !7, line: 10, baseType: !15, size: 128, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "Key", file: !7, line: 10, baseType: !15, size: 128, align: 64, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !7, line: 10, baseType: !24, size: 192, align: 64, offset: 256)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_NoUnkeyedLiteral", file: !7, line: 10, baseType: !31, align: 8, offset: 448)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "GetPrivateDataByRange", file: !25, line: 10, baseType: !241, size: 64, align: 64, offset: 896)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DISubroutineType(types: !243)
!243 = !{!217, !64, !15, !15, !15}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "GetPrivateDataHash", file: !25, line: 10, baseType: !210, size: 64, align: 64, offset: 960)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "GetPrivateDataQueryResult", file: !25, line: 10, baseType: !246, size: 64, align: 64, offset: 1024)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!217, !64, !15, !15}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "GetPrivateDataValidationParameter", file: !25, line: 10, baseType: !210, size: 64, align: 64, offset: 1088)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "GetQueryResult", file: !25, line: 10, baseType: !251, size: 64, align: 64, offset: 1152)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DISubroutineType(types: !253)
!253 = !{!217, !64, !15}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "GetQueryResultWithPagination", file: !25, line: 10, baseType: !255, size: 64, align: 64, offset: 1216)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{!258, !64, !15, !13, !15}
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{StateQueryIteratorInterface,*QueryResponseMetadata,error}", file: !25, size: 320, align: 8, elements: !259)
!259 = !{!219, !260, !269}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !25, line: 10, baseType: !261, size: 64, align: 64, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "QueryResponseMetadata", file: !7, line: 10, size: 448, align: 8, elements: !263)
!263 = !{!264, !265, !266, !267, !268}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "FetchedRecordsCount", file: !7, line: 10, baseType: !13, size: 32, align: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "Bookmark", file: !7, line: 10, baseType: !15, size: 128, align: 64, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_NoUnkeyedLiteral", file: !7, line: 10, baseType: !31, align: 8, offset: 192)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !7, line: 10, baseType: !24, size: 192, align: 64, offset: 192)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_sizecache", file: !7, line: 10, baseType: !13, size: 32, align: 32, offset: 384)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !25, line: 10, baseType: !94, size: 128, align: 64, offset: 192)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "GetSignedProposal", file: !25, line: 10, baseType: !271, size: 64, align: 64, offset: 1280)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!274, !64}
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*SignedProposal,error}", file: !25, size: 192, align: 8, elements: !275)
!275 = !{!276, !207}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !25, line: 10, baseType: !277, size: 64, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "SignedProposal", file: !7, line: 10, size: 640, align: 8, elements: !279)
!279 = !{!280, !281, !30, !32, !33}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "ProposalBytes", file: !7, line: 10, baseType: !24, size: 192, align: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", file: !7, line: 10, baseType: !24, size: 192, align: 64, offset: 192)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "GetState", file: !25, line: 10, baseType: !283, size: 64, align: 64, offset: 1344)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DISubroutineType(types: !285)
!285 = !{!129, !64, !15}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "GetStateByPartialCompositeKey", file: !25, line: 10, baseType: !287, size: 64, align: 64, offset: 1408)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DISubroutineType(types: !289)
!289 = !{!217, !64, !15, !106}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "GetStateByPartialCompositeKeyWithPagination", file: !25, line: 10, baseType: !291, size: 64, align: 64, offset: 1472)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{!258, !64, !15, !106, !13, !15}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "GetStateByRange", file: !25, line: 10, baseType: !246, size: 64, align: 64, offset: 1536)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "GetStateByRangeWithPagination", file: !25, line: 10, baseType: !296, size: 64, align: 64, offset: 1600)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DISubroutineType(types: !298)
!298 = !{!258, !64, !15, !15, !13, !15}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "GetStateValidationParameter", file: !25, line: 10, baseType: !283, size: 64, align: 64, offset: 1664)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "GetStringArgs", file: !25, line: 10, baseType: !301, size: 64, align: 64, offset: 1728)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DISubroutineType(types: !303)
!303 = !{!106, !64}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "GetTransient", file: !25, line: 10, baseType: !305, size: 64, align: 64, offset: 1792)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{!308, !64}
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Values,error}", file: !25, size: 192, align: 8, elements: !309)
!309 = !{!310, !207}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !25, line: 10, baseType: !140, size: 64, align: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "GetTxID", file: !25, line: 10, baseType: !102, size: 64, align: 64, offset: 1856)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "GetTxTimestamp", file: !25, line: 10, baseType: !313, size: 64, align: 64, offset: 1920)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DISubroutineType(types: !315)
!315 = !{!316, !64}
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Timestamp,error}", file: !25, size: 192, align: 8, elements: !317)
!317 = !{!318, !207}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !25, line: 10, baseType: !194, size: 64, align: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "InvokeChaincode", file: !25, line: 10, baseType: !320, size: 64, align: 64, offset: 1984)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{!10, !64, !15, !121, !15}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "PutPrivateData", file: !25, line: 10, baseType: !324, size: 64, align: 64, offset: 2048)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DISubroutineType(types: !326)
!326 = !{!94, !64, !15, !15, !24}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "PutState", file: !25, line: 10, baseType: !328, size: 64, align: 64, offset: 2112)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{!94, !64, !15, !24}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "SetEvent", file: !25, line: 10, baseType: !328, size: 64, align: 64, offset: 2176)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "SetPrivateDataValidationParameter", file: !25, line: 10, baseType: !324, size: 64, align: 64, offset: 2240)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "SetStateValidationParameter", file: !25, line: 10, baseType: !328, size: 64, align: 64, offset: 2304)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "SplitCompositeKey", file: !25, line: 10, baseType: !335, size: 64, align: 64, offset: 2368)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!338, !64, !15}
!338 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,struct{*string,int,int},error}", file: !25, size: 448, align: 8, elements: !339)
!339 = !{!92, !159, !340}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !25, line: 10, baseType: !94, size: 128, align: 64, offset: 320)
!341 = !DILocalVariable(name: "t", arg: 1, scope: !6, file: !7, line: 16, type: !34)
!342 = !DILocation(line: 0, scope: !6)
!343 = !DILocalVariable(name: "stub", arg: 2, scope: !6, file: !7, line: 16, type: !36)
!344 = !DILocation(line: 17, column: 28, scope: !6)
!345 = !DILocation(line: 17, column: 14, scope: !6)
!346 = !DILocation(line: 17, column: 2, scope: !6)
!347 = distinct !DISubprogram(name: "test.Invoke..1command-line-arguments.BadChaincode", linkageName: "command..z2dline..z2darguments.BadChaincode.Invoke", scope: null, file: !7, line: 20, type: !8, scopeLine: 20, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!348 = !DILocalVariable(name: "t", arg: 1, scope: !347, file: !7, line: 20, type: !34)
!349 = !DILocation(line: 0, scope: !347)
!350 = !DILocalVariable(name: "stub", arg: 2, scope: !347, file: !7, line: 20, type: !36)
!351 = !DILocation(line: 21, column: 18, scope: !352)
!352 = distinct !DILexicalBlock(scope: !347, file: !7, line: 20, column: 1)
!353 = !DILocalVariable(name: "fn", scope: !352, file: !7, line: 21, type: !15)
!354 = !DILocalVariable(name: "args", scope: !352, file: !7, line: 21, type: !106)
!355 = !DILocation(line: 22, column: 52, scope: !352)
!356 = !DILocation(line: 22, column: 21, scope: !352)
!357 = !DILocalVariable(name: "result", scope: !352, file: !7, line: 22, type: !24)
!358 = !DILocation(line: 22, column: 2, scope: !347)
!359 = !DILocalVariable(name: "err", scope: !352, file: !7, line: 22, type: !94)
!360 = !DILocation(line: 24, column: 9, scope: !352)
!361 = !DILocation(line: 25, column: 24, scope: !352)
!362 = !DILocation(line: 25, column: 15, scope: !352)
!363 = !DILocation(line: 25, column: 3, scope: !352)
!364 = !DILocalVariable(name: "output", scope: !352, file: !7, line: 28, type: !24)
!365 = !DILocation(line: 28, column: 2, scope: !347)
!366 = !DILocation(line: 29, column: 14, scope: !352)
!367 = !DILocation(line: 29, column: 2, scope: !352)
