; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v3;\\n\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22hex\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22encoding/hex\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22encoding/hex\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22shim\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/hyperledger/fabric-chaincode-go/shim\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22github.com/hyperledger/fabric-chaincode-go/shim\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22peer\22"
module asm "\09.ascii \22 \22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"Dwarf Version", i32 4}
!3 = distinct !DICompileUnit(language: DW_LANG_Go, file: !4, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !5)
!4 = !DIFile(filename: "./77.go", directory: "/home/ming/go/src/chaincode_repo/github/77")
!5 = !{!6, !23, !35, !37, !39, !41, !43, !45, !47, !49, !51, !53, !55, !57, !59, !61, !63, !65, !67, !69, !71, !73, !75, !77, !79, !81, !83, !85, !87, !89, !91, !93, !95, !97, !99, !101, !103, !105, !107, !109, !111, !113, !115, !117, !119, !121, !123, !125, !127, !129, !131, !133, !135, !137, !139, !141, !143, !145, !147, !149, !151, !153, !155, !157, !159, !161, !163, !165, !167, !169, !171, !173, !175, !177, !179, !181, !183, !185, !187, !189, !191, !193, !195, !197, !199, !201, !203, !205, !207, !209, !211, !213, !215, !217, !219, !221, !223, !225, !227, !229, !231, !233, !235, !237, !239, !241, !243, !245, !247, !249, !251, !253, !255, !257, !259, !261, !263, !265, !267, !269, !271, !273, !275, !277, !279, !281, !283, !285, !287, !289, !291, !293, !295, !297, !299, !301, !303, !305, !307, !309, !311, !313, !315, !317, !319, !321, !323, !325, !327, !329, !331, !333, !335, !337, !339, !341, !343, !345, !347, !349, !351, !353, !355, !357, !359, !361, !363, !365, !367, !369, !371, !373, !375, !377, !379, !381, !383, !385, !387, !389, !391, !393, !395, !397, !399, !401, !403, !405, !407, !409, !411, !413, !415, !417, !419, !421, !423, !425, !427, !429, !431, !433, !435, !437, !439, !441, !443, !445, !447, !449, !451, !453, !455, !457, !459, !461, !463, !465, !467, !469, !471, !473, !475, !477, !479, !481, !483, !485, !487, !489, !491, !493}
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !3, file: !8, line: 1, type: !9, isLocal: false, isDefinition: true)
!8 = !DIFile(filename: "<built-in>", directory: "")
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{bool,[3]uint8,bool,bool,uint64}", file: !10, size: 128, align: 8, elements: !11)
!10 = !DIFile(filename: "", directory: "")
!11 = !{!12, !14, !19, !20, !21}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", file: !10, line: 1, baseType: !13, size: 8, align: 8)
!13 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "pad", file: !10, line: 1, baseType: !15, size: 24, align: 8, offset: 8)
!15 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 24, align: 1, elements: !17)
!16 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!17 = !{!18}
!18 = !DISubrange(count: 3, lowerBound: 0)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "needed", file: !10, line: 1, baseType: !13, size: 8, align: 8, offset: 32)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "cgo", file: !10, line: 1, baseType: !13, size: 8, align: 8, offset: 40)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "alignme", file: !10, line: 1, baseType: !22, size: 64, align: 64, offset: 64)
!22 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(name: "bufio..types", linkageName: "bufio..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,[1]*void}", file: !10, size: 128, align: 8, elements: !26)
!26 = !{!27, !29}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !10, line: 1, baseType: !28, size: 64, align: 64)
!28 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "types", file: !10, line: 1, baseType: !30, size: 64, align: 64, offset: 64)
!30 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 64, align: 8, elements: !33)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DIBasicType(name: "void")
!33 = !{!34}
!34 = !DISubrange(count: 1, lowerBound: 0)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "bytes..types", linkageName: "bytes..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "compress_1flate..types", linkageName: "compress_1flate..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "compress_1gzip..types", linkageName: "compress_1gzip..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!41 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression())
!42 = distinct !DIGlobalVariable(name: "context..types", linkageName: "context..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!43 = !DIGlobalVariableExpression(var: !44, expr: !DIExpression())
!44 = distinct !DIGlobalVariable(name: "crypto..types", linkageName: "crypto..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!45 = !DIGlobalVariableExpression(var: !46, expr: !DIExpression())
!46 = distinct !DIGlobalVariable(name: "crypto_1cipher..types", linkageName: "crypto_1cipher..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(name: "crypto_1dsa..types", linkageName: "crypto_1dsa..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(name: "crypto_1ecdsa..types", linkageName: "crypto_1ecdsa..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "crypto_1ed25519_1internal_1edwards25519..types", linkageName: "crypto_1ed25519_1internal_1edwards25519..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!53 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression())
!54 = distinct !DIGlobalVariable(name: "crypto_1ed25519_1internal_1edwards25519_1field..types", linkageName: "crypto_1ed25519_1internal_1edwards25519_1field..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(name: "crypto_1elliptic..types", linkageName: "crypto_1elliptic..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(name: "crypto_1elliptic_1internal_1fiat..types", linkageName: "crypto_1elliptic_1internal_1fiat..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(name: "crypto_1elliptic_1internal_1nistec..types", linkageName: "crypto_1elliptic_1internal_1nistec..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(name: "crypto_1internal_1randutil..types", linkageName: "crypto_1internal_1randutil..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "crypto_1md5..types", linkageName: "crypto_1md5..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!65 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression())
!66 = distinct !DIGlobalVariable(name: "crypto_1rand..types", linkageName: "crypto_1rand..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!67 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression())
!68 = distinct !DIGlobalVariable(name: "crypto_1rsa..types", linkageName: "crypto_1rsa..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(name: "crypto_1sha1..types", linkageName: "crypto_1sha1..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(name: "crypto_1sha256..types", linkageName: "crypto_1sha256..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!73 = !DIGlobalVariableExpression(var: !74, expr: !DIExpression())
!74 = distinct !DIGlobalVariable(name: "crypto_1sha512..types", linkageName: "crypto_1sha512..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!75 = !DIGlobalVariableExpression(var: !76, expr: !DIExpression())
!76 = distinct !DIGlobalVariable(name: "crypto_1tls..types", linkageName: "crypto_1tls..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "crypto_1x509..types", linkageName: "crypto_1x509..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!79 = !DIGlobalVariableExpression(var: !80, expr: !DIExpression())
!80 = distinct !DIGlobalVariable(name: "crypto_1x509_1pkix..types", linkageName: "crypto_1x509_1pkix..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!81 = !DIGlobalVariableExpression(var: !82, expr: !DIExpression())
!82 = distinct !DIGlobalVariable(name: "encoding_1asn1..types", linkageName: "encoding_1asn1..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!83 = !DIGlobalVariableExpression(var: !84, expr: !DIExpression())
!84 = distinct !DIGlobalVariable(name: "encoding_1base64..types", linkageName: "encoding_1base64..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!85 = !DIGlobalVariableExpression(var: !86, expr: !DIExpression())
!86 = distinct !DIGlobalVariable(name: "encoding_1binary..types", linkageName: "encoding_1binary..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!87 = !DIGlobalVariableExpression(var: !88, expr: !DIExpression())
!88 = distinct !DIGlobalVariable(name: "encoding_1hex..types", linkageName: "encoding_1hex..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!89 = !DIGlobalVariableExpression(var: !90, expr: !DIExpression())
!90 = distinct !DIGlobalVariable(name: "encoding_1json..types", linkageName: "encoding_1json..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "encoding_1pem..types", linkageName: "encoding_1pem..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!93 = !DIGlobalVariableExpression(var: !94, expr: !DIExpression())
!94 = distinct !DIGlobalVariable(name: "errors..types", linkageName: "errors..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!95 = !DIGlobalVariableExpression(var: !96, expr: !DIExpression())
!96 = distinct !DIGlobalVariable(name: "flag..types", linkageName: "flag..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(name: "fmt..types", linkageName: "fmt..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!99 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression())
!100 = distinct !DIGlobalVariable(name: "github_0com_1golang_1protobuf_1jsonpb..types", linkageName: "github_0com_1golang_1protobuf_1jsonpb..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!101 = !DIGlobalVariableExpression(var: !102, expr: !DIExpression())
!102 = distinct !DIGlobalVariable(name: "github_0com_1golang_1protobuf_1proto..types", linkageName: "github_0com_1golang_1protobuf_1proto..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!103 = !DIGlobalVariableExpression(var: !104, expr: !DIExpression())
!104 = distinct !DIGlobalVariable(name: "github_0com_1golang_1protobuf_1ptypes_1any..types", linkageName: "github_0com_1golang_1protobuf_1ptypes_1any..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(name: "github_0com_1golang_1protobuf_1ptypes_1duration..types", linkageName: "github_0com_1golang_1protobuf_1ptypes_1duration..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(name: "github_0com_1golang_1protobuf_1ptypes_1empty..types", linkageName: "github_0com_1golang_1protobuf_1ptypes_1empty..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "github_0com_1golang_1protobuf_1ptypes_1timestamp..types", linkageName: "github_0com_1golang_1protobuf_1ptypes_1timestamp..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(name: "github_0com_1hyperledger_1fabric_x2dchaincode_x2dgo_1shim..types", linkageName: "github_0com_1hyperledger_1fabric_x2dchaincode_x2dgo_1shim..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!114 = distinct !DIGlobalVariable(name: "github_0com_1hyperledger_1fabric_x2dprotos_x2dgo_1common..types", linkageName: "github_0com_1hyperledger_1fabric_x2dprotos_x2dgo_1common..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(name: "github_0com_1hyperledger_1fabric_x2dprotos_x2dgo_1ledger_1queryresult..types", linkageName: "github_0com_1hyperledger_1fabric_x2dprotos_x2dgo_1ledger_1queryresult..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(name: "github_0com_1hyperledger_1fabric_x2dprotos_x2dgo_1ledger_1rwset..types", linkageName: "github_0com_1hyperledger_1fabric_x2dprotos_x2dgo_1ledger_1rwset..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(name: "github_0com_1hyperledger_1fabric_x2dprotos_x2dgo_1msp..types", linkageName: "github_0com_1hyperledger_1fabric_x2dprotos_x2dgo_1msp..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(name: "github_0com_1hyperledger_1fabric_x2dprotos_x2dgo_1peer..types", linkageName: "github_0com_1hyperledger_1fabric_x2dprotos_x2dgo_1peer..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "go_1token..types", linkageName: "go_1token..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!125 = !DIGlobalVariableExpression(var: !126, expr: !DIExpression())
!126 = distinct !DIGlobalVariable(name: "golang_0org_1x_1crypto_1chacha20..types", linkageName: "golang_0org_1x_1crypto_1chacha20..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "golang_0org_1x_1crypto_1chacha20poly1305..types", linkageName: "golang_0org_1x_1crypto_1chacha20poly1305..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!129 = !DIGlobalVariableExpression(var: !130, expr: !DIExpression())
!130 = distinct !DIGlobalVariable(name: "golang_0org_1x_1crypto_1cryptobyte..types", linkageName: "golang_0org_1x_1crypto_1cryptobyte..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "golang_0org_1x_1crypto_1curve25519..types", linkageName: "golang_0org_1x_1crypto_1curve25519..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(name: "golang_0org_1x_1crypto_1curve25519_1internal_1field..types", linkageName: "golang_0org_1x_1crypto_1curve25519_1internal_1field..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(name: "golang_0org_1x_1net_1dns_1dnsmessage..types", linkageName: "golang_0org_1x_1net_1dns_1dnsmessage..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(name: "golang_0org_1x_1net_1http2..types", linkageName: "golang_0org_1x_1net_1http2..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(name: "golang_0org_1x_1net_1http2_1hpack..types", linkageName: "golang_0org_1x_1net_1http2_1hpack..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(name: "golang_0org_1x_1net_1http_1httpguts..types", linkageName: "golang_0org_1x_1net_1http_1httpguts..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(name: "golang_0org_1x_1net_1http_1httpproxy..types", linkageName: "golang_0org_1x_1net_1http_1httpproxy..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!145 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression())
!146 = distinct !DIGlobalVariable(name: "golang_0org_1x_1net_1idna..types", linkageName: "golang_0org_1x_1net_1idna..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(name: "golang_0org_1x_1net_1internal_1timeseries..types", linkageName: "golang_0org_1x_1net_1internal_1timeseries..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(name: "golang_0org_1x_1net_1trace..types", linkageName: "golang_0org_1x_1net_1trace..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(name: "golang_0org_1x_1sys_1unix..types", linkageName: "golang_0org_1x_1sys_1unix..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "golang_0org_1x_1text_1secure_1bidirule..types", linkageName: "golang_0org_1x_1text_1secure_1bidirule..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(name: "golang_0org_1x_1text_1transform..types", linkageName: "golang_0org_1x_1text_1transform..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(name: "golang_0org_1x_1text_1unicode_1bidi..types", linkageName: "golang_0org_1x_1text_1unicode_1bidi..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!159 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!160 = distinct !DIGlobalVariable(name: "golang_0org_1x_1text_1unicode_1norm..types", linkageName: "golang_0org_1x_1text_1unicode_1norm..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!161 = !DIGlobalVariableExpression(var: !162, expr: !DIExpression())
!162 = distinct !DIGlobalVariable(name: "google_0golang_0org_1genproto_1googleapis_1rpc_1status..types", linkageName: "google_0golang_0org_1genproto_1googleapis_1rpc_1status..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc..types", linkageName: "google_0golang_0org_1grpc..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1balancer..types", linkageName: "google_0golang_0org_1grpc_1balancer..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1balancer_1base..types", linkageName: "google_0golang_0org_1grpc_1balancer_1base..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1balancer_1roundrobin..types", linkageName: "google_0golang_0org_1grpc_1balancer_1roundrobin..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1binarylog_1grpc__binarylog__v1..types", linkageName: "google_0golang_0org_1grpc_1binarylog_1grpc__binarylog__v1..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1codes..types", linkageName: "google_0golang_0org_1grpc_1codes..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1connectivity..types", linkageName: "google_0golang_0org_1grpc_1connectivity..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1credentials..types", linkageName: "google_0golang_0org_1grpc_1credentials..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1encoding..types", linkageName: "google_0golang_0org_1grpc_1encoding..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1encoding_1proto..types", linkageName: "google_0golang_0org_1grpc_1encoding_1proto..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1grpclog..types", linkageName: "google_0golang_0org_1grpc_1grpclog..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal..types", linkageName: "google_0golang_0org_1grpc_1internal..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1backoff..types", linkageName: "google_0golang_0org_1grpc_1internal_1backoff..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1balancer_1gracefulswitch..types", linkageName: "google_0golang_0org_1grpc_1internal_1balancer_1gracefulswitch..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1balancerload..types", linkageName: "google_0golang_0org_1grpc_1internal_1balancerload..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1binarylog..types", linkageName: "google_0golang_0org_1grpc_1internal_1binarylog..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1channelz..types", linkageName: "google_0golang_0org_1grpc_1internal_1channelz..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1credentials..types", linkageName: "google_0golang_0org_1grpc_1internal_1credentials..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1envconfig..types", linkageName: "google_0golang_0org_1grpc_1internal_1envconfig..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1grpclog..types", linkageName: "google_0golang_0org_1grpc_1internal_1grpclog..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1grpcrand..types", linkageName: "google_0golang_0org_1grpc_1internal_1grpcrand..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1resolver_1dns..types", linkageName: "google_0golang_0org_1grpc_1internal_1resolver_1dns..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1resolver_1passthrough..types", linkageName: "google_0golang_0org_1grpc_1internal_1resolver_1passthrough..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1resolver_1unix..types", linkageName: "google_0golang_0org_1grpc_1internal_1resolver_1unix..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1serviceconfig..types", linkageName: "google_0golang_0org_1grpc_1internal_1serviceconfig..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1syscall..types", linkageName: "google_0golang_0org_1grpc_1internal_1syscall..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1transport..types", linkageName: "google_0golang_0org_1grpc_1internal_1transport..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1resolver..types", linkageName: "google_0golang_0org_1grpc_1resolver..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1encoding_1protojson..types", linkageName: "google_0golang_0org_1protobuf_1encoding_1protojson..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1encoding_1protowire..types", linkageName: "google_0golang_0org_1protobuf_1encoding_1protowire..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1descfmt..types", linkageName: "google_0golang_0org_1protobuf_1internal_1descfmt..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1descopts..types", linkageName: "google_0golang_0org_1protobuf_1internal_1descopts..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1detrand..types", linkageName: "google_0golang_0org_1protobuf_1internal_1detrand..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1encoding_1json..types", linkageName: "google_0golang_0org_1protobuf_1internal_1encoding_1json..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1encoding_1tag..types", linkageName: "google_0golang_0org_1protobuf_1internal_1encoding_1tag..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1encoding_1text..types", linkageName: "google_0golang_0org_1protobuf_1internal_1encoding_1text..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1errors..types", linkageName: "google_0golang_0org_1protobuf_1internal_1errors..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1filedesc..types", linkageName: "google_0golang_0org_1protobuf_1internal_1filedesc..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1filetype..types", linkageName: "google_0golang_0org_1protobuf_1internal_1filetype..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1impl..types", linkageName: "google_0golang_0org_1protobuf_1internal_1impl..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1order..types", linkageName: "google_0golang_0org_1protobuf_1internal_1order..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1proto..types", linkageName: "google_0golang_0org_1protobuf_1proto..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1reflect_1protoreflect..types", linkageName: "google_0golang_0org_1protobuf_1reflect_1protoreflect..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1reflect_1protoregistry..types", linkageName: "google_0golang_0org_1protobuf_1reflect_1protoregistry..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1types_1descriptorpb..types", linkageName: "google_0golang_0org_1protobuf_1types_1descriptorpb..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1types_1known_1anypb..types", linkageName: "google_0golang_0org_1protobuf_1types_1known_1anypb..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1types_1known_1durationpb..types", linkageName: "google_0golang_0org_1protobuf_1types_1known_1durationpb..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1types_1known_1emptypb..types", linkageName: "google_0golang_0org_1protobuf_1types_1known_1emptypb..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1types_1known_1timestamppb..types", linkageName: "google_0golang_0org_1protobuf_1types_1known_1timestamppb..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(name: "hash_1crc32..types", linkageName: "hash_1crc32..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(name: "html..types", linkageName: "html..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "html_1template..types", linkageName: "html_1template..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!267 = !DIGlobalVariableExpression(var: !268, expr: !DIExpression())
!268 = distinct !DIGlobalVariable(name: "internal_1cpu..types", linkageName: "internal_1cpu..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(name: "internal_1intern..types", linkageName: "internal_1intern..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(name: "internal_1oserror..types", linkageName: "internal_1oserror..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(name: "internal_1poll..types", linkageName: "internal_1poll..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "internal_1reflectlite..types", linkageName: "internal_1reflectlite..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(name: "internal_1testlog..types", linkageName: "internal_1testlog..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "io..types", linkageName: "io..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(name: "io_1fs..types", linkageName: "io_1fs..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(name: "io_1ioutil..types", linkageName: "io_1ioutil..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(name: "log..types", linkageName: "log..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(name: "math..types", linkageName: "math..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: "math_1big..types", linkageName: "math_1big..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "math_1rand..types", linkageName: "math_1rand..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(name: "mime..types", linkageName: "mime..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "mime_1multipart..types", linkageName: "mime_1multipart..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(name: "mime_1quotedprintable..types", linkageName: "mime_1quotedprintable..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(name: "net..types", linkageName: "net..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(name: "net_1http..types", linkageName: "net_1http..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "net_1http_1httputil..types", linkageName: "net_1http_1httputil..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "net_1http_1internal..types", linkageName: "net_1http_1internal..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(name: "net_1netip..types", linkageName: "net_1netip..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "net_1textproto..types", linkageName: "net_1textproto..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "os..types", linkageName: "os..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(name: "path..types", linkageName: "path..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(name: "path_1filepath..types", linkageName: "path_1filepath..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(name: "reflect..types", linkageName: "reflect..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "regexp..types", linkageName: "regexp..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(name: "regexp_1syntax..types", linkageName: "regexp_1syntax..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(name: "runtime..types", linkageName: "runtime..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "sort..types", linkageName: "sort..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "strconv..types", linkageName: "strconv..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(name: "sync..types", linkageName: "sync..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(name: "syscall..types", linkageName: "syscall..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(name: "text_1tabwriter..types", linkageName: "text_1tabwriter..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "text_1template..types", linkageName: "text_1template..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(name: "text_1template_1parse..types", linkageName: "text_1template_1parse..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "time..types", linkageName: "time..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "unicode..types", linkageName: "unicode..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "container_1list..types", linkageName: "container_1list..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(name: "crypto_1aes..types", linkageName: "crypto_1aes..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "crypto_1des..types", linkageName: "crypto_1des..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "crypto_1ed25519..types", linkageName: "crypto_1ed25519..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "crypto_1hmac..types", linkageName: "crypto_1hmac..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(name: "crypto_1internal_1subtle..types", linkageName: "crypto_1internal_1subtle..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(name: "crypto_1rc4..types", linkageName: "crypto_1rc4..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(name: "crypto_1subtle..types", linkageName: "crypto_1subtle..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(name: "encoding..types", linkageName: "encoding..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "github_0com_1golang_1protobuf_1ptypes..types", linkageName: "github_0com_1golang_1protobuf_1ptypes..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "github_0com_1hyperledger_1fabric_x2dchaincode_x2dgo_1shim_1internal..types", linkageName: "github_0com_1hyperledger_1fabric_x2dchaincode_x2dgo_1shim_1internal..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "golang_0org_1x_1crypto_1cryptobyte_1asn1..types", linkageName: "golang_0org_1x_1crypto_1cryptobyte_1asn1..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "golang_0org_1x_1crypto_1hkdf..types", linkageName: "golang_0org_1x_1crypto_1hkdf..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "golang_0org_1x_1crypto_1internal_1poly1305..types", linkageName: "golang_0org_1x_1crypto_1internal_1poly1305..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "golang_0org_1x_1crypto_1internal_1subtle..types", linkageName: "golang_0org_1x_1crypto_1internal_1subtle..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "golang_0org_1x_1sys_1internal_1unsafeheader..types", linkageName: "golang_0org_1x_1sys_1internal_1unsafeheader..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1attributes..types", linkageName: "google_0golang_0org_1grpc_1attributes..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1backoff..types", linkageName: "google_0golang_0org_1grpc_1backoff..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1balancer_1grpclb_1state..types", linkageName: "google_0golang_0org_1grpc_1balancer_1grpclb_1state..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1channelz..types", linkageName: "google_0golang_0org_1grpc_1channelz..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1credentials_1insecure..types", linkageName: "google_0golang_0org_1grpc_1credentials_1insecure..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1buffer..types", linkageName: "google_0golang_0org_1grpc_1internal_1buffer..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1grpcsync..types", linkageName: "google_0golang_0org_1grpc_1internal_1grpcsync..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1grpcutil..types", linkageName: "google_0golang_0org_1grpc_1internal_1grpcutil..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1metadata..types", linkageName: "google_0golang_0org_1grpc_1internal_1metadata..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1pretty..types", linkageName: "google_0golang_0org_1grpc_1internal_1pretty..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1resolver..types", linkageName: "google_0golang_0org_1grpc_1internal_1resolver..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1status..types", linkageName: "google_0golang_0org_1grpc_1internal_1status..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1transport_1networktype..types", linkageName: "google_0golang_0org_1grpc_1internal_1transport_1networktype..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1keepalive..types", linkageName: "google_0golang_0org_1grpc_1keepalive..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1metadata..types", linkageName: "google_0golang_0org_1grpc_1metadata..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1peer..types", linkageName: "google_0golang_0org_1grpc_1peer..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1serviceconfig..types", linkageName: "google_0golang_0org_1grpc_1serviceconfig..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1stats..types", linkageName: "google_0golang_0org_1grpc_1stats..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1status..types", linkageName: "google_0golang_0org_1grpc_1status..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1tap..types", linkageName: "google_0golang_0org_1grpc_1tap..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1encoding_1prototext..types", linkageName: "google_0golang_0org_1protobuf_1encoding_1prototext..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1encoding_1defval..types", linkageName: "google_0golang_0org_1protobuf_1internal_1encoding_1defval..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1encoding_1messageset..types", linkageName: "google_0golang_0org_1protobuf_1internal_1encoding_1messageset..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1flags..types", linkageName: "google_0golang_0org_1protobuf_1internal_1flags..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1genid..types", linkageName: "google_0golang_0org_1protobuf_1internal_1genid..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1pragma..types", linkageName: "google_0golang_0org_1protobuf_1internal_1pragma..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1set..types", linkageName: "google_0golang_0org_1protobuf_1internal_1set..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1strs..types", linkageName: "google_0golang_0org_1protobuf_1internal_1strs..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1version..types", linkageName: "google_0golang_0org_1protobuf_1internal_1version..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1reflect_1protodesc..types", linkageName: "google_0golang_0org_1protobuf_1reflect_1protodesc..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1runtime_1protoiface..types", linkageName: "google_0golang_0org_1protobuf_1runtime_1protoiface..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1runtime_1protoimpl..types", linkageName: "google_0golang_0org_1protobuf_1runtime_1protoimpl..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(name: "hash..types", linkageName: "hash..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "hash_1fnv..types", linkageName: "hash_1fnv..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(name: "internal_1abi..types", linkageName: "internal_1abi..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(name: "internal_1bytealg..types", linkageName: "internal_1bytealg..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(name: "internal_1fmtsort..types", linkageName: "internal_1fmtsort..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(name: "internal_1goarch..types", linkageName: "internal_1goarch..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(name: "internal_1godebug..types", linkageName: "internal_1godebug..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(name: "internal_1goexperiment..types", linkageName: "internal_1goexperiment..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(name: "internal_1goos..types", linkageName: "internal_1goos..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(name: "internal_1itoa..types", linkageName: "internal_1itoa..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(name: "internal_1nettrace..types", linkageName: "internal_1nettrace..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(name: "internal_1race..types", linkageName: "internal_1race..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(name: "internal_1singleflight..types", linkageName: "internal_1singleflight..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(name: "internal_1syscall_1execenv..types", linkageName: "internal_1syscall_1execenv..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(name: "internal_1syscall_1unix..types", linkageName: "internal_1syscall_1unix..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(name: "internal_1unsafeheader..types", linkageName: "internal_1unsafeheader..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(name: "math_1bits..types", linkageName: "math_1bits..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(name: "net_1http_1httptrace..types", linkageName: "net_1http_1httptrace..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(name: "net_1http_1internal_1ascii..types", linkageName: "net_1http_1internal_1ascii..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(name: "net_1url..types", linkageName: "net_1url..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(name: "runtime_1internal_1atomic..types", linkageName: "runtime_1internal_1atomic..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(name: "runtime_1internal_1math..types", linkageName: "runtime_1internal_1math..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(name: "runtime_1internal_1sys..types", linkageName: "runtime_1internal_1sys..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(name: "strings..types", linkageName: "strings..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(name: "sync_1atomic..types", linkageName: "sync_1atomic..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(name: "unicode_1utf16..types", linkageName: "unicode_1utf16..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(name: "unicode_1utf8..types", linkageName: "unicode_1utf8..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(name: "main..types", linkageName: "main..types", scope: !3, file: !10, type: !25, isLocal: false, isDefinition: true)
!495 = distinct !DISubprogram(name: "__go_init_main", scope: null, file: !496, line: 7, type: !497, scopeLine: 7, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !499)
!496 = !DIFile(filename: "77.go", directory: ".")
!497 = !DISubroutineType(types: !498)
!498 = !{!32}
!499 = !{}
!500 = !DILocation(line: 1, column: 1, scope: !501)
!501 = !DILexicalBlockFile(scope: !495, file: !8, discriminator: 0)
!502 = !DILocation(line: 5, column: 15, scope: !503, inlinedAt: !505)
!503 = distinct !DISubprogram(name: "main.main..init0", scope: null, file: !504, line: 5, type: !497, scopeLine: 5, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !499)
!504 = !DIFile(filename: "_gomod_.go", directory: "/tmp/go-build/b001")
!505 = distinct !DILocation(line: 5, column: 1, scope: !506)
!506 = !DILexicalBlockFile(scope: !495, file: !504, discriminator: 0)
!507 = distinct !DISubprogram(name: "main.SimpleAsset.Init", scope: null, file: !496, line: 24, type: !508, scopeLine: 24, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !499)
!508 = !DISubroutineType(types: !509)
!509 = !{!510, !530, !530, !532}
!510 = !DICompositeType(tag: DW_TAG_structure_type, name: "Response", file: !496, line: 13, size: 640, align: 8, elements: !511)
!511 = !{!512, !514, !520, !526, !528, !529}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "Status", file: !496, line: 13, baseType: !513, size: 32, align: 32)
!513 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "Message", file: !496, line: 13, baseType: !515, size: 128, align: 64, offset: 64)
!515 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !8, line: 1, size: 128, align: 8, elements: !516)
!516 = !{!517, !519}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !8, line: 1, baseType: !518, size: 64, align: 64)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !8, line: 1, baseType: !28, size: 64, align: 64, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "Payload", file: !496, line: 13, baseType: !521, size: 192, align: 64, offset: 192)
!521 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !10, size: 192, align: 8, elements: !522)
!522 = !{!523, !524, !525}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !518, size: 64, align: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !10, line: 1, baseType: !28, size: 64, align: 64, offset: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !10, line: 1, baseType: !28, size: 64, align: 64, offset: 128)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_NoUnkeyedLiteral", file: !496, line: 13, baseType: !527, align: 8, offset: 384)
!527 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !8, line: 1, align: 1, elements: !499)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !496, line: 13, baseType: !521, size: 192, align: 64, offset: 384)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_sizecache", file: !496, line: 13, baseType: !513, size: 32, align: 32, offset: 576)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DICompositeType(tag: DW_TAG_structure_type, name: "SimpleAsset", file: !496, line: 18, align: 1, elements: !499)
!532 = !DICompositeType(tag: DW_TAG_structure_type, name: "ChaincodeStubInterface", file: !496, line: 13, size: 128, align: 8, elements: !533)
!533 = !{!534, !877}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !496, line: 13, baseType: !535, size: 64, align: 64)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string,struct{*string,int,int})struct{string,error},*func(*void,string,string)error,*func(*void,string)error,*func(*void)struct{*struct{*uint8,int,int},int,int},*func(*void)struct{struct{*uint8,int,int},error},*func(*void)struct{struct{*uint8,int,int},error},*func(*void)string,*func(*void)struct{struct{*uint8,int,int},error},*func(*void)Values,*func(*void)struct{string,struct{*string,int,int}},*func(*void,string)struct{HistoryQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string,string,struct{*string,int,int})struct{StateQueryIteratorInterface,error},*func(*void,string,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string)struct{StateQueryIteratorInterface,error},*func(*void,string,int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void)struct{*SignedProposal,error},*func(*void,string)struct{struct{*uint8,int,int},error},*func(*void,string,struct{*string,int,int})struct{StateQueryIteratorInterface,error},*func(*void,string,struct{*string,int,int},int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string,int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void,string)struct{struct{*uint8,int,int},error},*func(*void)struct{*string,int,int},*func(*void)struct{Values,error},*func(*void)string,*func(*void)struct{*Timestamp,error},*func(*void,string,struct{*struct{*uint8,int,int},int,int},string)Response,*func(*void,string,string)error,*func(*void,string,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string)struct{string,struct{*string,int,int},error}}", file: !10, size: 2496, align: 8, elements: !537)
!537 = !{!538, !579, !602, !606, !610, !618, !626, !627, !628, !629, !646, !653, !1893, !1897, !1924, !1928, !1929, !1933, !1934, !1938, !1953, !1965, !1969, !1973, !1977, !1978, !1982, !1983, !1987, !1994, !1995, !2002, !2006, !2007, !2011, !2015, !2016, !2017, !2018}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !10, line: 13, baseType: !539, size: 64, align: 64)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !8, line: 1, size: 512, align: 8, elements: !541)
!541 = !{!542, !544, !545, !547, !548, !549, !550, !551, !559, !560, !562, !578}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !8, line: 1, baseType: !543, size: 64, align: 64)
!543 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !8, line: 1, baseType: !543, size: 64, align: 64, offset: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !8, line: 1, baseType: !546, size: 32, align: 32, offset: 128)
!546 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 160)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 168)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 176)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 184)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !8, line: 1, baseType: !552, size: 64, align: 64, offset: 192)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !8, line: 1, size: 64, align: 8, elements: !554)
!554 = !{!555}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !8, line: 1, baseType: !556, size: 64, align: 64)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DISubroutineType(types: !558)
!558 = !{!13, !31, !31}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !8, line: 1, baseType: !518, size: 64, align: 64, offset: 256)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !8, line: 1, baseType: !561, size: 64, align: 64, offset: 320)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !8, line: 1, baseType: !563, size: 64, align: 64, offset: 384)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !8, line: 1, size: 320, align: 8, elements: !565)
!565 = !{!566, !567, !568}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !8, line: 1, baseType: !561, size: 64, align: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !8, line: 1, baseType: !561, size: 64, align: 64, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !8, line: 1, baseType: !569, size: 192, align: 64, offset: 128)
!569 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !10, size: 192, align: 8, elements: !570)
!570 = !{!571, !524, !525}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !572, size: 64, align: 64)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !8, line: 1, size: 320, align: 8, elements: !574)
!574 = !{!566, !567, !575, !576, !577}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !8, line: 1, baseType: !31, size: 64, align: 64, offset: 128)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !8, line: 1, baseType: !31, size: 64, align: 64, offset: 192)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !8, line: 1, baseType: !31, size: 64, align: 64, offset: 256)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !8, line: 1, baseType: !31, size: 64, align: 64, offset: 448)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "CreateCompositeKey", file: !10, line: 13, baseType: !580, size: 64, align: 64, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DISubroutineType(types: !582)
!582 = !{!583, !31, !515, !599}
!583 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,error}", file: !10, size: 256, align: 8, elements: !584)
!584 = !{!585, !586}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 13, baseType: !515, size: 128, align: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 13, baseType: !587, size: 128, align: 64, offset: 128)
!587 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !8, line: 1, size: 128, align: 8, elements: !588)
!588 = !{!589, !598}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 1, baseType: !590, size: 64, align: 64)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !10, size: 128, align: 8, elements: !592)
!592 = !{!593, !594}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !10, line: 1, baseType: !539, size: 64, align: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !10, line: 1, baseType: !595, size: 64, align: 64, offset: 64)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DISubroutineType(types: !597)
!597 = !{!515, !31}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !8, line: 1, baseType: !31, size: 64, align: 64, offset: 64)
!599 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !10, size: 192, align: 8, elements: !600)
!600 = !{!601, !524, !525}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !561, size: 64, align: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "DelPrivateData", file: !10, line: 13, baseType: !603, size: 64, align: 64, offset: 128)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DISubroutineType(types: !605)
!605 = !{!587, !31, !515, !515}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "DelState", file: !10, line: 13, baseType: !607, size: 64, align: 64, offset: 192)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DISubroutineType(types: !609)
!609 = !{!587, !31, !515}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "GetArgs", file: !10, line: 13, baseType: !611, size: 64, align: 64, offset: 256)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DISubroutineType(types: !613)
!613 = !{!614, !31}
!614 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*uint8,int,int},int,int}", file: !10, size: 192, align: 8, elements: !615)
!615 = !{!616, !524, !525}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !617, size: 64, align: 64)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "GetArgsSlice", file: !10, line: 13, baseType: !619, size: 64, align: 64, offset: 320)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DISubroutineType(types: !621)
!621 = !{!622, !31}
!622 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*uint8,int,int},error}", file: !10, size: 320, align: 8, elements: !623)
!623 = !{!624, !625}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 14, baseType: !521, size: 192, align: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 14, baseType: !587, size: 128, align: 64, offset: 192)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "GetBinding", file: !10, line: 13, baseType: !619, size: 64, align: 64, offset: 384)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "GetChannelID", file: !10, line: 13, baseType: !595, size: 64, align: 64, offset: 448)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "GetCreator", file: !10, line: 13, baseType: !619, size: 64, align: 64, offset: 512)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "GetDecorations", file: !10, line: 13, baseType: !630, size: 64, align: 64, offset: 576)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DISubroutineType(types: !632)
!632 = !{!633, !31}
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !8, line: 1, size: 384, align: 8, elements: !635)
!635 = !{!636, !637, !638, !639, !641, !642, !643, !644, !645}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !8, line: 1, baseType: !28, size: 64, align: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 72)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !8, line: 1, baseType: !640, size: 16, align: 16, offset: 80)
!640 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !8, line: 1, baseType: !546, size: 32, align: 32, offset: 96)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !8, line: 1, baseType: !31, size: 64, align: 64, offset: 128)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !8, line: 1, baseType: !31, size: 64, align: 64, offset: 192)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !8, line: 1, baseType: !543, size: 64, align: 64, offset: 256)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !8, line: 1, baseType: !31, size: 64, align: 64, offset: 320)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "GetFunctionAndParameters", file: !10, line: 13, baseType: !647, size: 64, align: 64, offset: 640)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DISubroutineType(types: !649)
!649 = !{!650, !31}
!650 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,struct{*string,int,int}}", file: !10, size: 320, align: 8, elements: !651)
!651 = !{!585, !652}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 13, baseType: !599, size: 192, align: 64, offset: 128)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "GetHistoryForKey", file: !10, line: 13, baseType: !654, size: 64, align: 64, offset: 704)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DISubroutineType(types: !656)
!656 = !{!657, !31, !515}
!657 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{HistoryQueryIteratorInterface,error}", file: !10, size: 256, align: 8, elements: !658)
!658 = !{!659, !586}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 13, baseType: !660, size: 128, align: 64)
!660 = !DICompositeType(tag: DW_TAG_structure_type, name: "HistoryQueryIteratorInterface", file: !496, line: 13, size: 128, align: 8, elements: !661)
!661 = !{!662, !877}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !496, line: 13, baseType: !663, size: 64, align: 64)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void)bool,*func(*void)struct{*KeyModification,error}}", file: !10, size: 256, align: 8, elements: !665)
!665 = !{!538, !666, !670, !674}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !10, line: 13, baseType: !667, size: 64, align: 64, offset: 64)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DISubroutineType(types: !669)
!669 = !{!587, !31}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "HasNext", file: !10, line: 13, baseType: !671, size: 64, align: 64, offset: 128)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DISubroutineType(types: !673)
!673 = !{!13, !31}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "Next", file: !10, line: 13, baseType: !675, size: 64, align: 64, offset: 192)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DISubroutineType(types: !677)
!677 = !{!678, !31}
!678 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*KeyModification,error}", file: !10, size: 192, align: 8, elements: !679)
!679 = !{!680, !1376}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 13, baseType: !681, size: 64, align: 64)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DICompositeType(tag: DW_TAG_structure_type, name: "KeyModification", file: !496, line: 13, size: 704, align: 8, elements: !683)
!683 = !{!684, !685, !686, !1889, !1890, !1891, !1892}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "TxId", file: !496, line: 13, baseType: !515, size: 128, align: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !496, line: 13, baseType: !521, size: 192, align: 64, offset: 128)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "Timestamp", file: !496, line: 13, baseType: !687, size: 64, align: 64, offset: 320)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DICompositeType(tag: DW_TAG_structure_type, name: "Timestamp", file: !496, line: 13, size: 448, align: 8, elements: !689)
!689 = !{!690, !1884, !1885, !1886, !1888}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !496, line: 13, baseType: !691, size: 64, align: 64)
!691 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageState", file: !496, line: 13, size: 64, align: 8, elements: !692)
!692 = !{!693, !695, !704, !710}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "NoUnkeyedLiterals", file: !496, line: 13, baseType: !694, align: 8)
!694 = !DICompositeType(tag: DW_TAG_structure_type, name: "NoUnkeyedLiterals", file: !496, line: 13, align: 1, elements: !499)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "DoNotCompare", file: !496, line: 13, baseType: !696, align: 64)
!696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !697, align: 8, elements: !702)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !496, line: 13, size: 64, align: 8, elements: !699)
!699 = !{!700}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !496, line: 13, baseType: !701, size: 64, align: 64)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!702 = !{!703}
!703 = !DISubrange(count: 0, lowerBound: 0)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "DoNotCopy", file: !496, line: 13, baseType: !705, align: 32)
!705 = !DICompositeType(tag: DW_TAG_array_type, baseType: !706, align: 4, elements: !702)
!706 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !496, line: 13, size: 64, align: 4, elements: !707)
!707 = !{!708, !709}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !496, line: 13, baseType: !513, size: 32, align: 32)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !496, line: 13, baseType: !546, size: 32, align: 32, offset: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "atomicMessageInfo", file: !496, line: 13, baseType: !711, size: 64, align: 64)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageInfo", file: !496, line: 13, size: 2624, align: 8, elements: !713)
!713 = !{!714, !878, !1676, !1684, !1689, !1690, !1691, !1786}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "GoReflectType", file: !496, line: 13, baseType: !715, size: 128, align: 64)
!715 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type", file: !496, line: 13, size: 128, align: 8, elements: !716)
!716 = !{!717, !877}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !496, line: 13, baseType: !718, size: 64, align: 64)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)int,*func(*void,Type)bool,*func(*void)int,*func(*void)ChanDir,*func(*void)bool,*func(*void,Type)bool,*func(*void)Type,*func(*void,int)StructField,*func(*void)int,*func(*void,struct{*int,int,int})StructField,*func(*void,string)struct{StructField,bool},*func(*void,*__go_descriptor)struct{StructField,bool},*func(*void,Type)bool,*func(*void,int)Type,*func(*void)bool,*func(*void)Type,*func(*void)Kind,*func(*void)int,*func(*void,int)Method,*func(*void,string)struct{Method,bool},*func(*void)string,*func(*void)int,*func(*void)int,*func(*void)int,*func(*void)int,*func(*void,int)Type,*func(*void)string,*func(*void)uintptr,*func(*void)string,*func(*void)*.reflect.rtype,*func(*void)string,*func(*void)*.reflect.uncommonType}", file: !10, size: 2112, align: 8, elements: !720)
!720 = !{!538, !721, !725, !729, !730, !735, !736, !737, !741, !762, !763, !767, !775, !786, !787, !791, !792, !793, !798, !799, !848, !856, !857, !858, !859, !860, !861, !862, !863, !867, !868, !872, !873}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "Align", file: !10, line: 13, baseType: !722, size: 64, align: 64, offset: 64)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DISubroutineType(types: !724)
!724 = !{!28, !31}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "AssignableTo", file: !10, line: 13, baseType: !726, size: 64, align: 64, offset: 128)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{!13, !31, !715}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "Bits", file: !10, line: 13, baseType: !722, size: 64, align: 64, offset: 192)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "ChanDir", file: !10, line: 13, baseType: !731, size: 64, align: 64, offset: 256)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DISubroutineType(types: !733)
!733 = !{!734, !31}
!734 = !DIBasicType(name: "ChanDir", size: 64, encoding: DW_ATE_signed)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "Comparable", file: !10, line: 13, baseType: !671, size: 64, align: 64, offset: 320)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "ConvertibleTo", file: !10, line: 13, baseType: !726, size: 64, align: 64, offset: 384)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "Elem", file: !10, line: 13, baseType: !738, size: 64, align: 64, offset: 448)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{!715, !31}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "Field", file: !10, line: 13, baseType: !742, size: 64, align: 64, offset: 512)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DISubroutineType(types: !744)
!744 = !{!745, !31, !28}
!745 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructField", file: !496, line: 13, size: 832, align: 8, elements: !746)
!746 = !{!747, !748, !749, !750, !755, !756, !761}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !496, line: 13, baseType: !515, size: 128, align: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "PkgPath", file: !496, line: 13, baseType: !515, size: 128, align: 64, offset: 128)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !496, line: 13, baseType: !715, size: 128, align: 64, offset: 256)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "Tag", file: !496, line: 13, baseType: !751, size: 128, align: 64, offset: 384)
!751 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructTag", file: !496, line: 13, size: 128, align: 8, elements: !752)
!752 = !{!753, !754}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !496, line: 1, baseType: !518, size: 64, align: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !496, line: 1, baseType: !28, size: 64, align: 64, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", file: !496, line: 13, baseType: !543, size: 64, align: 64, offset: 512)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !496, line: 13, baseType: !757, size: 192, align: 64, offset: 576)
!757 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*int,int,int}", file: !10, size: 192, align: 8, elements: !758)
!758 = !{!759, !524, !525}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !760, size: 64, align: 64)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "Anonymous", file: !496, line: 13, baseType: !13, size: 8, align: 8, offset: 768)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "FieldAlign", file: !10, line: 13, baseType: !722, size: 64, align: 64, offset: 576)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "FieldByIndex", file: !10, line: 13, baseType: !764, size: 64, align: 64, offset: 640)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DISubroutineType(types: !766)
!766 = !{!745, !31, !757}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "FieldByName", file: !10, line: 13, baseType: !768, size: 64, align: 64, offset: 704)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DISubroutineType(types: !770)
!770 = !{!771, !31, !515}
!771 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{StructField,bool}", file: !10, size: 896, align: 8, elements: !772)
!772 = !{!773, !774}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 13, baseType: !745, size: 832, align: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 13, baseType: !13, size: 8, align: 8, offset: 832)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "FieldByNameFunc", file: !10, line: 13, baseType: !776, size: 64, align: 64, offset: 768)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DISubroutineType(types: !778)
!778 = !{!771, !31, !779}
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !496, line: 13, size: 64, align: 8, elements: !781)
!781 = !{!782}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !496, line: 13, baseType: !783, size: 64, align: 64)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DISubroutineType(types: !785)
!785 = !{!13, !515}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "Implements", file: !10, line: 13, baseType: !726, size: 64, align: 64, offset: 832)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "In", file: !10, line: 13, baseType: !788, size: 64, align: 64, offset: 896)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DISubroutineType(types: !790)
!790 = !{!715, !31, !28}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "IsVariadic", file: !10, line: 13, baseType: !671, size: 64, align: 64, offset: 960)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "Key", file: !10, line: 13, baseType: !738, size: 64, align: 64, offset: 1024)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "Kind", file: !10, line: 13, baseType: !794, size: 64, align: 64, offset: 1088)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DISubroutineType(types: !796)
!796 = !{!797, !31}
!797 = !DIBasicType(name: "Kind", size: 64, encoding: DW_ATE_unsigned)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !10, line: 13, baseType: !722, size: 64, align: 64, offset: 1152)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "Method", file: !10, line: 13, baseType: !800, size: 64, align: 64, offset: 1216)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DISubroutineType(types: !802)
!802 = !{!803, !31, !28}
!803 = !DICompositeType(tag: DW_TAG_structure_type, name: "Method", file: !496, line: 13, size: 640, align: 8, elements: !804)
!804 = !{!747, !748, !749, !805, !847}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "Func", file: !496, line: 13, baseType: !806, size: 192, align: 64, offset: 384)
!806 = !DICompositeType(tag: DW_TAG_structure_type, name: "Value", file: !496, line: 13, size: 192, align: 8, elements: !807)
!807 = !{!808, !844, !845}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !496, line: 13, baseType: !809, size: 64, align: 64)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DICompositeType(tag: DW_TAG_structure_type, name: ".reflect.rtype", file: !496, line: 13, size: 512, align: 8, elements: !811)
!811 = !{!812, !813, !814, !815, !817, !818, !819, !820, !825, !826, !827, !843}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !496, line: 13, baseType: !543, size: 64, align: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !496, line: 13, baseType: !543, size: 64, align: 64, offset: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !496, line: 13, baseType: !546, size: 32, align: 32, offset: 128)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !496, line: 13, baseType: !816, size: 8, align: 8, offset: 160)
!816 = !DIBasicType(name: ".reflect.tflag", size: 8, encoding: DW_ATE_unsigned)
